[
    {
        "title": "Software Engineer",
        "company": "Tech Solutions Inc.",
        "location": "San Francisco",
        "salary": null,
        "description": "We are looking for a Software Engineer to join our team.\nResponsibilities:\nDevelop and maintain web applications.\nCollaborate with cross-functional teams.\nParticipate in code reviews.\nQualifications:\nBachelor's degree in Computer Science or related field.\n2+ years of experience in software development.\nProficiency in JavaScript, HTML, and CSS.\nBenefits:\nCompetitive salary.\nHealth insurance.\nFlexible working hours.\nSalary and compensation\n$80,000 — $120,000/year\nLocation\nSan Francisco",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-tech-solutions-inc-1128205"
    },
    {
        "title": "SDE I Backend",
        "company": "Netomi",
        "location": "Remote - India",
        "salary": null,
        "description": "About the Company:\nNetomi is the leading agentic AI platform for enterprise customer experience. We work with the largest global brands like Delta Airlines, MetLife, MGM, United, and others to enable agentic automation at scale across the entire customer journey. Our no-code platform delivers the fastest time to market, lowest total cost of ownership, and simple, scalable management of AI agents for any CX use case. Backed by WndrCo, Y Combinator, and Index Ventures, we help enterprises drive efficiency, lower costs, and deliver higher quality customer experiences.\nWant to be part of the AI revolution and transform how the world’s largest global brands do business? Join us!\nWe are looking for a Software Engineer with experience in Java development. We are looking for someone who brings in experience of coding, fixing, executing and versioning existing code for applications. We are looking for someone who is ready to think beyond and is ready to take bigger responsibilities. If you're passionate to solve real time fundamental problems, explore, learn and work on technologies out of scope, Netomi is the perfect place for you.\nResponsibilities\nAssist in planning, design and execution of SOA backend platforms and mostly around REST based Web.\nFrameworks using JAVA (Spark, Spring, ORM).\nHigh-level and low-level design of the highly scalable components.\nTrack defects and works with business owners and users to triage bugs and manage a backlog.\nTaking care of Non-functional requirements like Scale/ High Availability/Performance/Security.\nBuild/Deployments/DevOps related work on AWS.\nWorks collaboratively in a multi-disciplinary team environment; establishes and maintains professional networks with subject matter experts.\nAssist key technical advisors in defining the project roadmap.\nRequirements\nExperience on SOA, Multitenant platforms, SaaS platforms (It’s a plus)\n1-3 years’ experience – proficient in Java / J2EE\nExperience with Amazon web services or similar environment\nExperience on some scripting language for automated build/ deployments (It’s a plus)\nNetomi is an equal opportunity employer committed to diversity in the workplace. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, disability, veteran status, and other protected characteristics.\nLocation\nRemote - India",
        "url": "https://remoteok.com/remote-jobs/remote-sde-i-backend-netomi-1128204"
    },
    {
        "title": "Machine Learning Engineer",
        "company": "Jobgether",
        "location": "United States",
        "salary": null,
        "description": "This position is posted by Jobgether on behalf of a partner company. We are currently looking for a Machine Learning Engineer in the United States. This role focuses on designing, developing, and deploying advanced machine learning solutions that leverage data to drive business outcomes.\nSalary and compensation\n$80,000 — $120,000/year\nLocation\nUnited States",
        "url": "https://remoteok.com/remote-jobs/remote-machine-learning-engineer-jobgether-1128203"
    },
    {
        "title": "Protocol Engineer",
        "company": "Magic",
        "location": "Remote - United States",
        "salary": null,
        "description": "About Magic Labs\nMagic is innovating at the intersection of crypto and AI to make wallets invisible and capable of running on autopilot.\nIn 2018, we introduced the first embedded wallet, enabling users to create wallets with just an email or social login. This approach has since become standard across much of the industry. To date, we’ve helped onboard over 50 million wallets and 200,000 developers, supporting projects like Polymarket, Helium, WalletConnect, and Immutable, as well as enterprises such as Forbes, Mattel, and Naver. We’re backed by investors including PayPal Ventures, Lightspeed, Placeholder, SV Angel, Naval Ravikant, and Balaji Srinivasan.\nToday, we’re building Newton to help bring about the wallet endgame—where AI and automation completely abstract away the complexity of onchain interactions beyond wallet creation. This means applying state-of-the-art technologies from both AI and crypto and delivering them through a product and protocol that can scale to billions. Our vision is a future of self-driving capital that extends the financial system upgrade made possible by web3.\nThis role is open to candidates based anywhere in the US or Canada, with a slight preference for those in commuting distance of NYC. \nUnfortunately, we are unable to sponsor or take over sponsorship (ex., H-1B transfer) of employment visas, and applicants must be authorized to work for any employer in the US or Canada.\nLocation\nRemote - United States",
        "url": "https://remoteok.com/remote-jobs/remote-protocol-engineer-magic-1128202"
    },
    {
        "title": "Python Developer",
        "company": "Ampcontrol",
        "location": "🇨🇦 Canada",
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-python-developer-ampcontrol-1096950"
    },
    {
        "title": "Senior Application Engineer Python",
        "company": "Egen",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About Egen:\nEgen is a fast-growing and entrepreneurial company with a data-first mindset. We bring together the best engineering talent working with the most advanced technology platforms, including Google Cloud and Salesforce, to help clients drive action and impact through data and insights. We are committed to being a place where the best people choose to work so they can apply their engineering and technology expertise to envision what is next for how data and platforms can change the world for the better. We are dedicated to learning, thrive on solving tough problems, and continually innovate to achieve fast, effective results. If this describes you, we want you on our team.\nWant to learn more about life at Egen? Check out these resources in addition to the job description.\nMeet Egen\nLife at Egen\nCulture and Values at Egen\nCareer Development at Egen\nBenefits at Egen\nAbout the opportunity:  \nWe’re looking for a Senior Application Engineer to design and build the applications and services that bring AI/ML insights to life for end users. This role bridges the gap between raw data/models and the user experience—delivering intuitive, performant, and scalable solutions. You will work across the full stack, from server-side APIs and microservices to engaging front-end interfaces, while ensuring seamless integration with our AI/ML ecosystem.\nResponsibilities:\nDevelop full-stack applications and workflows with modern architectures, following 12-factor app principles\nBuild and maintain backend services in Python\nDesign and implement RESTful APIs and containerized services for application delivery\nCreate intuitive, high-performance front-end experiences using frameworks like React, Vue.js, or Angular\nCollaborate closely with Solutions Architects to ensure application design aligns with business and technical requirements\nImplement cloud-native solutions on Google Cloud or Azure, including containerization, async events, and cloud managed services\nWork with relational and NoSQL databases (MySQL, PostgreSQL, MongoDB), including schema management and database schema migration tools\nApply testing frameworks and best practices to ensure application quality, performance, and scalability\nParticipate in Agile ceremonies—daily scrums, sprint planning, architecture/design sessions\nContribute to automation, CI/CD strategies, and release management\nEnsure code quality, security, and adherence to non-functional requirements\nBasic Qualifications:\n4+ years of professional software development experience with full-stack applications\nStrong proficiency in Python\nExperience building RESTful APIs and containerized services (Docker, Kubernetes)\nStrong front-end skills with React, Vue.js, or Angular\nExperience with Google Cloud or Azure services for application deployment and scaling\nSolid understanding of microservices architecture and 12-factor app methodology\nStrong database experience with MySQL, MongoDB, PostgreSQL, or SQL Server\nFamiliarity with configuration and secret management tools\nKnowledge of testing frameworks and Agile/Scrum methodologies\nExcellent troubleshooting, debugging, and system design skills\n$120,000 - $140,000 a year\nCompensation & Benefits:\nThis role is eligible for our competitive salary and comprehensive benefits package to support your well-being:\nComprehensive Health Insurance\nPaid Leave (Vacation/PTO)\nPaid Holidays\nSick Leave\nParental Leave\nBereavement Leave\n401 (k) Employer Match\nEmployee Referral Bonuses\nCheck out our complete list of benefits here - >https://egen.ai/people/#benefits\nImportant: All roles are subject to standard hiring verification practices, which may include background checks, employment verification, and other relevant checks.\nEEO and Accommodations:\nEgen is an equal opportunity employer and is committed to inclusion, diversity, and equity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veterans’ status, or any other characteristic protected by federal, state, or local laws. Egen will also consider qualified applications with criminal histories, consistent with legal requirements. Egen welcomes and encourages applications from individuals with disabilities. Reasonable accommodations are available for candidates during all aspects of the selection process. Please advise the talent acquisition team if you require accommodations during the interview process.\nBenefits\n⏰ Async\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-senior-application-engineer-python-egen-1128194"
    },
    {
        "title": "Frontend Engineer",
        "company": "ZetaChain",
        "location": "Remote – Argentina & Latin America",
        "salary": null,
        "description": "About ZetaChain\nWe're building something ambitious at ZetaChain: the first universal blockchain that connects everything—Bitcoin, Ethereum, every chain. We're backed by top investors, live on mainnet, and building the future of blockchain technology. If you're excited about working on big, meaningful problems with a world-class team, you're in the right place.\nAbout the Role\nYou’ll focus on building smooth, beautiful, and scalable user-facing products. You’ll work closely with design and product to deliver UI/UX that feels native to Web3 but friendly to mainstream users.\nResponsibilities\nDevelop responsive, high-performance frontends using React/Next.js.\nIntegrate blockchain features (wallet login, transactions, on-chain data).\nCollaborate with design to ship fast, delightful user experiences.\nOptimize performance across devices and browsers.\nRequirements\n3+ years frontend experience.\nStrong in React/Next.js, TypeScript, CSS frameworks.\nExperience integrating Web3 libraries (ethers.js, wagmi, WalletConnect).\nEye for design and detail; able to work closely with product.\nGrowth & Culture\nBe the UI/UX champion of the team.\nClose collaboration with product and design, high ownership over user experience.\nRemote-first, startup pace, flat structure.\nCompensation\nLocation\nRemote – Argentina & Latin America",
        "url": "https://remoteok.com/remote-jobs/remote-frontend-engineer-zetachain-1128192"
    },
    {
        "title": "Staff Software Engineer ML Ranking Platform",
        "company": "Reddit",
        "location": "Remote - United States",
        "salary": null,
        "description": "Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 101M+ daily active unique visitors, Reddit is one of the internet’s largest sources of information. For more information, visit redditinc.com. Location: This role is completely remote-friendly. If you happen to live close to one of our physical office locations, our doors are open for you to come into the office as often as you'd like. Team Description: At Reddit, our ML Ranking Platform is the brain behind how millions of people discover content every day. As a Staff Software Engineer, ML Ranking Platform, you will set (and lead) the technical vision for designing highly robust, scalable, reliable and performant ranking systems that power personalized feeds at Reddit scale. You’ll drive strategy, lead high-impact projects, and mentor teams building the ranking engines that balance speed, relevance, and reliability. Your work not only powers Reddit feeds; it’ll also shape how communities connect, grow, and thrive across Reddit!\nLocation\nRemote - United States",
        "url": "https://remoteok.com/remote-jobs/remote-staff-software-engineer-ml-ranking-platform-reddit-1128191"
    },
    {
        "title": "Software Engineer II",
        "company": "Wealth.com",
        "location": "Remote, United States",
        "salary": null,
        "description": "Wealth.com is the industry’s leading estate planning platform, empowering financial advisors to offer modern, comprehensive estate planning solutions to their clients. By combining cutting-edge technology, AI, and unmatched human expertise, we deliver a seamless experience that sets us apart. Beyond having one of the most coveted domain names in FinTech, wealth.com is a dynamic, revenue-generating startup experiencing rapid yet sustainable growth.\nA key reason behind our position as the #1 estate planning platform is our team. Our people thrive in a collaborative, supportive culture that fosters innovation and makes wealth.com a place where everyone truly enjoys working. Wealth.com is certified as a Great Place to Work for 2024 and named a 2024 finalist for Fast Company’s Best Workplaces for Innovators!\nAs a Software Engineer II, you’ll play a key role in designing, developing, and maintaining high-quality software solutions. You’ll work closely with cross-functional teams to build scalable and performant applications while mentoring junior engineers and driving best practices. We expect that you will be proficient in either Frontend or Backend development – bonus points if you are, or desire to be, full-stack!\nOverall Responsibilities:\nArchitect, design, and develop robust, scalable, and maintainable software solutions.\nCollaborate with product managers, designers, and other engineers to deliver high-impact features.\nEnsure code quality through peer reviews, testing, and automation.\nOptimize applications for performance, security, and reliability.\nStay up to date with industry trends and bring innovative ideas to the table.\nAdditional Responsibilities- Frontend Specialists\nImplement modern web interfaces using React, CSS, Typescript, and modern design libraries.\nExperience with GraphQL clients like Apollo.\nBuild reusable libraries with mono repo build systems (NX).\nBuild reusable React components for interfacing with our back-end platforms.\nAnalyze and optimize UI and infrastructure application code for quality, efficiency, and performance.\nAdditional Responsibilities- Backend Specialists\nDevelop the core application logic, databases, and APIs to ensure efficient data management and seamless communication between the front end and server.\nCreate RESTful or GraphQL APIs to enable smooth data exchange between various software components and external systems.\nOptimize code and infrastructure to handle increasing loads, ensuring the application can scale efficiently.\nQualifications:\n3-5 years of experience in software development.\nStrong proficiency in and experience with\n(Frontend Specialists) React, Typescript, HTML, Javascript, CSS\nOR (Backend Specialists) C#/.NET, Typescript, GraphQL, DynamoDB, MySQL\nDeep understanding of system design, data structures, and algorithms.\nExperience with cloud platforms like AWS (preferred) or GCP.\nStrong problem-solving skills and ability to work independently.\nExcellent communication and collaboration skills.\nBonus Points:\nFull-stack development experience or affinity.\nFamiliarity with DevOps practices, CI/CD pipelines, and infrastructure as code.\nContributions to open-source projects or personal tech blogs.\nExperience with Microfrontend architecture\nExperience with monorepo build systems\n$143,000 - $163,000 a year\nWealth is an equal opportunity employer and encourages people from all backgrounds to apply. Should you have a disability or special need that requires accommodation, please let us know.\nLocation\nRemote, United States",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-ii-wealth-com-1128188"
    },
    {
        "title": "Senior Software Engineer Backend",
        "company": "Magic",
        "location": "Remote - United States",
        "salary": null,
        "description": "About Magic Labs\nMagic is innovating at the intersection of crypto and AI to make wallets invisible and capable of running on autopilot.\nIn 2018, we introduced the first embedded wallet, enabling users to create wallets with just an email or social login. This approach has since become standard across much of the industry. To date, we’ve helped onboard over 50 million wallets and 200,000 developers, supporting projects like Polymarket, Helium, WalletConnect, and Immutable, as well as enterprises such as Forbes, Mattel, and Naver. We’re backed by investors including PayPal Ventures, Lightspeed, Placeholder, SV Angel, Naval Ravikant, and Balaji Srinivasan.\nToday, we’re building Newton to help bring about the wallet endgame—where AI and automation completely abstract away the complexity of onchain interactions beyond wallet creation. This means applying state-of-the-art technologies from both AI and crypto and delivering them through a product and protocol that can scale to billions. Our vision is a future of self-driving capital that extends the financial system upgrade made possible by web3.\nThis role is open to candidates based anywhere in the US or Canada, with a slight preference for those in commuting distance of NYC. \nUnfortunately, we are unable to sponsor or take over sponsorship (ex., H-1B transfer) of employment visas, and applicants must be authorized to work for any employer in the US or Canada.\nLocation\nRemote - United States",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-backend-magic-1128183"
    },
    {
        "title": "Senior Water Wastewater Engineer",
        "company": "ERG",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "ERG is a research and consulting firm that provides a wide range of support to federal, state, and commercial clients. ERG offers multidisciplinary teams with nationally recognized skills in engineering, science, economics, public health, informational technology, and communications. We hire people with the best minds and then provide them with a vibrant and flexible environment in which to develop their careers. The qualified individual must be highly motivated with the skills to prioritize, perform, and communicate effectively in a fast-paced environment.\nERG is seeking an experienced, highly motivated Senior Water/Wastewater Engineer to lead a variety of water infrastructure projects. You will have the opportunity to work directly with communities nationwide to assess infrastructure needs, develop projects, and access infrastructure funding. Your work will put communities on a path to addressing critical challenges in delivering clean, safe drinking water and protecting water quality.\nJob Description:\nAs a Senior Water/Wastewater Engineer you will primarily lead multidisciplinary teams of engineers, scientists, and analysts in providing technical assistance to municipalities for the planning and design of drinking water, wastewater, and stormwater infrastructure projects in small, under-resourced communities\nResponsibilities include independently assessing community water or wastewater infrastructure needs, developing clear, well-documented planning documents and technical reports (e.g., Preliminary Engineering Reports), and delivering preliminary and detailed project designs that can be used to secure infrastructure funding\nYou will also lead meetings with community stakeholders to gather relevant information and facilitate project support and buy-in\nDepending upon your qualifications and experience, you may support a variety of other projects, which could include assessing and promoting innovative water and wastewater treatment technologies, evaluating the design, cost, and environmental impacts of water and wastewater infrastructure projects, and supporting efforts to reduce the human health and environmental impacts of PFAS and other emerging contaminants\nAs a Senior Water/Wastewater Engineer and subject matter expert, you will also have the opportunity to mentor junior and mid-level staff\nQualifications and Skills:\nBachelor’s degree in Civil or Environmental Engineering\nActive Professional Engineer (PE) license in at least one U.S. state (multiple state licenses preferred)\n15+ years of relevant experience in municipalities water or wastewater system planning and design, including familiarity with funding, financing, and governance frameworks for Capital Improvement Programs\nExperience with decentralized wastewater systems is a plus but not required\nWillingness to travel to assess community infrastructure needs\nStrong written and oral communication skills\nExperience evaluating the infrastructure needs of small and rural communities\nExperience developing Master Plans, Capital Improvement Plans, Facility Plans, and Feasibility Studies for water infrastructure\nWater distribution, wastewater collection, and water/wastewater treatment system design experience, including working knowledge of 3D modeling, hydraulic analysis, process design, and asset management software\n$110,000 - $170,000 a year\nERG offers competitive salaries and excellent benefits, including health and dental insurance, life insurance, long-term disability, educational benefits, FSAs, a generous 401k plan, profit sharing, an EAP, 11-20 paid vacation days per year, 10 paid holidays per year, 56 hours or more of sick leave (based on the state you work in) per year (pro-rated for part-time) and more. The salary range for all positions depends on the years and type of experience. \n  \nERG is an equal opportunity employer and complies with all applicable EEOC regulations. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual preference, national origin, disability, or status as a protected veteran.  \n   \nPlease be aware, the only authentic corporate domain for ERG is https://www.erg.com.  ERG may, on occasion, screen applicants via telephone or video interviews via Skype, Teams, GoToMeeting, or another type of video platform. However, any candidate extended a job offer might be asked to meet in person with an ERG employee before providing confidential personal information associated with new employment. \n  \nIf you’re a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access ERG’s online application process as a result of your disability. To request accommodation, please contact Human Resources via email at Resumes-Lex@erg.com or call (781) 674-7293. \n  \nERG fosters a friendly, flexible work environment. ERGers are dedicated to serving clients who are committed to making the world a better place. We promote and recognize principles of fairness and respect in the work we do, the partnerships we foster, and the culture we value both within and outside of our organization.\nBenefits\n💰 401(k)\n🦷 Dental insurance\n💰 Profit sharing",
        "url": "https://remoteok.com/remote-jobs/remote-senior-water-wastewater-engineer-erg-1128182"
    },
    {
        "title": "Senior AI Engineer Agentic",
        "company": "Cast AI",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Remote - About the roleAPA/Agentic – An intelligent agentic system that not only detects application performance issues but proactively resolves them. By deeply integrating with observability stacks and leveraging Kubernetes, APA automates optimization, scaling, security, anâ€¦",
        "url": "https://remoteok.com/remote-jobs/remote-senior-ai-engineer-agentic-cast-ai-1128181"
    },
    {
        "title": "Senior Software Development Engineer",
        "company": "Recharge",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Who we are\nIn a world where acquisition costs are skyrocketing, funding is scarce, and ecommerce merchants are forced to do more with less, the most innovative DTC brands understand that subscription strategy is business strategy.\nRecharge is simplifying retention and growth for innovative ecommerce brands. As the #1 subscription platform, Recharge is dedicated to empowering brands to easily set up and manage subscriptions, create dynamic experiences at every customer touchpoint, and continuously evaluate business performance. Powering everything from no-code customer portals, personalized offers, and dynamic bundles, Recharge helps merchants seamlessly manage, grow, and delight their subscribers while reducing operating costs and churn. Today, Recharge powers more than 20,000 merchants serving 100 million subscribers, including brands such as Blueland, Hello Bello, LOLA, Chamberlain Coffee, and Bobbie—Recharge doesn’t just help you sell products, we help build buyer routines that last.\nRecharge is recognized on the Technology Fast 500, awarded by Deloitte, (3rd consecutive year) and is Great Place to Work Certified.\nRole Overview\nThe Storefront Team at Recharge is responsible for storefront widgets and backend services. These inject Recharge features; Subscriptions, Bundles, and Loyalty benefits into our merchant’s checkout experience. They handle 2.5M+ sessions per day and are some of our highest scale components in our platform. Checkout performance is critical to driving merchant revenue. As a result our widgets require high performance and stability.\nIn addition to the front-end widgets, the team is also responsible for supporting back-end services consisting of SQL/document databases, a CDN, event-driven messaging systems and REST APIs.\nOur Tech Stack: Python, Flask, React with Remix and Chakra UI, Vue.js, GCP, Elasticsearch, Redis, CloudSQL/MySQL\nWho you are\nWe\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-development-engineer-recharge-1128180"
    },
    {
        "title": "Software Engineer",
        "company": "Valinor",
        "location": "New York, NY",
        "salary": null,
        "description": "There are too many problems that are unaddressed in the resiliency ecosystem. These problems, while quiet, are significant; and left unsolved they create gaps that widen until systems crack and missions stall. Valinor is a new type of defense and government tech company focused on solving the problems others don’t. Our unique model of centralized go-to-market and decentralized engineering allows us to move with unparalleled efficiency to identify unmet needs, build right-sized solutions, and get products where they matter most - in the hands of users. Unlike others in the space, who focus on the flashy problems, Valinor exists to solve the quiet, unaddressed problems–the small but significant ones that lead to cracks in the country’s strength, stability, and security. Backed by General Catalyst, Founders Fund, and Red Cell Partners, Valinor was founded in 2024 and has established strategic partnerships with Palantir, Anduril, and Helsing. We are building the dream team, and we want y\nLocation\nNew York, NY",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-valinor-1128176"
    },
    {
        "title": "Senior Software Engineer Backend",
        "company": "Superhuman",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "SUPERHUMAN 👉We exist so that professionals end each day feeling happier, more productive, and closer to achieving their potential.Our customers get through their inboxes twice as fast; many see inbox zero for the first time in years.Today we are…* The fastest email experience in the world\nLoved and adored: see what our customers say\n📣 We've joined forces with Grammarly to build the AI-native productivity suite of the future, with Superhuman as the central communication layer. This partnership accelerates our mission to help professionals achieve their potential — now at even greater scale.Come shape the future of email, communication, and productivity!BUILD LOVE 💜At Superhuman, we deeply understand how to build products that people love. We incorporate fun and play; we infuse magic and joy; we make experiences that amaze and delight.It all starts with the right team — a team that deeply cares about values, customers, and each other.CREATE MASSIVE IMPACT 🚀We're not solving a small problem, and we're not addressing a small market. We're going after email; the one activity that consumes more of our work day than any other.Our ambition doesn't stop there. Next: calendars, notes, contacts, and team communication. We are building the productivity platform of the future.DO THE BEST WORK OF YOUR LIFE 🌟We have created the frameworks for how to build product market fit and redefined the narrative of how to onboard customers successfully. We have shown the world it’s possible to build a premium productivity brand. Our investors included Andreessen Horowitz, First Round Capital, IVP, Tiger Global Management, Sam Altman, and the founders of Gmail, Dropbox, Reddit, Discord, Stripe, GitHub, AngelList, and Intercom.This time, we’re swinging beyond the fences and fundamentally rethinking how individuals and teams should collaborate. We are building a household brand and a worldwide organization. We are here to do the best work of our lives, and we hope you are too.ROLE 👩🏽‍💻👨‍💻* Design, develop, and scale backend systems that serve millions of users\nPower amazing user experiences by building new features and improving existing ones\nEvaluate and refine solutions to deliver a highly performant and exceptionally reliable backend system\nBecome an expert in backend development and expand your development across the stack and to various platforms\nCollaborate across teams to define how our systems should evolve\nSupport code quality, new technologies, and architectural design within the company\nUphold and advance the security and reliability of Superhuman’s systems\nTechnologies we use: Go, Postgres, Redis, Kubernetes, Google Cloud\nSOUND LIKE YOU? 🙌* Experience: You have 5+ years of software development experience, with 4+ years focused on backend development. You’re an expert in Go, Typescript, or Python. You have deep expertise in architecting for performance and scale.\nAI Enthusiast: You believe AI will revolutionize how we work as well as the experiences that we create for our customers. Driven by passion and curiosity, you leverage AI to dramatically increase your own productivity and the impact of your team.\nRemarkable Quality: You produce work that is striking, worthy of attention, and a contribution to the state of the art.\nAsynchronous Communicator: You’re effective across various mediums (especially Slack, Notion, and email) and can produce and consume detailed written materials as needed without sacrificing speed. You respond quickly and thoughtfully to unblock others and speed things up.\nStart-to-Finish Ownership: Acts with 100% responsibility for their own outcomes as well as the outcomes of the company.\nBias to action: Speed matters. Takes rapid and decisive steps forward, even in the face of uncertainty, recognizing action is the catalyst for progress and growth.\nGrowth Mindset: You embrace challenges, welcome feedback, and believe you and others can always grow.\nSALARY INFO 💸Superhuman takes a market-based approach to compensation, which means base pay may vary depending on your location.Base pay may vary considerably depending on job-related knowledge, skills, and experience. The expected salary ranges for this position are outlined below by location and may be modified in the future.* SF/NY/Seattle: $180,000-$306,000\nOther US geographies: $162,000-$275,000\nCanada: $128,000-$246,000 CAD\nThe salary ranges do not reflect total compensation, which includes base salary, benefits, and company equity. This range is intentionally broad because we are open to considering candidates at multiple levels of seniority within engineering. The exact salary offered will depend on the candidate’s skills, experience, and the level at which they join our team.BENEFITS 🎁Taking Care of Your Future 🙏* Comprehensive medical, dental, and vision coverage for you and your family\nMental health support and counseling services\nRetirement savings plans with employer matching\nLife and disability insurance coverage\nGenerous Time Off 🏝* Generous paid vacation days and public holidays\nComprehensive parental and caregiver leave policies\nInvesting in Your Growth ✍️* Professional development budget for courses, training, and books\nRegular feedback and career development check-ins\nSetting You Up For Success 🧑🏻‍💻👩🏾‍💻* MacBook Pro laptop for your work\nStandard setup with monitor, keyboard, and mouse/trackpad\nGenerous budget to make your workspace your own\nAt Superhuman, we value diversity. We are an equal opportunity employer: we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nBenefits\n⏰ Async",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-backend-superhuman-1128174"
    },
    {
        "title": "Full‑Stack Software Engineer",
        "company": "Toku",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About Toku\nEvery company in the world runs payroll. But the rails underneath it haven’t changed since the 1970s.\nToku is building what comes next - infrastructure that makes payroll work the way the internet does: instantly, globally, and without unnecessary friction.\n‍\nWe enable companies to pay teams in stablecoins, fiat, or tokens - without switching systems, retraining staff, or giving up compliance. With one API, Toku connects into platforms like ADP, Gusto, or Workday, and upgrades the back end to move money in seconds instead of days.\nWe're building the future of payroll and we're just getting started.\nTo learn more, check our website.\nEngineering Team - Who We Are\nWe’re an early, fast‑moving team that ships with care. We work closely with customers, value pragmatic engineering, clear documentation and keep reliability, correctness and security front and center.\nThe Role\nYou’ll own the core product areas end‑to‑end: from scoping, technical design to build, launch, and iteration. You’ll collaborate with operations and product teams on decisions and ship things balancing speed with sound engineering. If you want broad ownership and immediate user impact, you’ll fit right in.\nWhat You’ll Do\nShip user‑facing features across the stack with short feedback loops.\nTurn customer problems into simple and clear product solutions.\nWrite robust, type‑safe, well‑tested code and stable APIs, keep docs and observability healthy.\nRaise the bar on engineering practices: PR reviews, automated testing, and robust CI/CD.\nProactively identify opportunities to improve existing practices and uphold Toku’s high technical quality bar\nAnticipate edge cases, flag blockers early in the process, drive incidents to root cause, and prevent regressions.\nLead feature work from PRD, design doc (RFC) to rollout: data models, API contracts, and UI flows.\nUse AI tools to accelerate development, testing, and documentation.\nRequirements\n3+ years building and operating production web apps end-to-end.\nStrong proficiency in TypeScript and JavaScript.\nFrontend knowledge: React or Next.js, performance, accessibility and testing fundamentals.\nBackend knowledge: Node.js with Express (or similar), Next js API routes, REST, JWT/OAuth, webhooks, background jobs.\nDatabase: Postgres (or other SQL based DBs), schema design, transactions, migrations, and basic performance tuning.\nDevEx and Infra: Knowledge of Git/GitHub, CI/CD, Docker; environment/secrets hygiene.\nObservability: Experience with popular observability tools (for eg. LogRocket, New Relic, Sentry)\nGood problem solving and communication skills\nAbility to pick up unfamiliar tech fast and execute if required in some scenarios\nProduct mindset: clarify ambiguity quickly and slice scope to deliver outcomes.\nCode quality: clear abstractions, type safety, tests.\nOwnership: you like taking work from 0→1→10 and closing the loop with users.\nHands‑on with AI‑assisted development (for eg. Copilot, Cursor, Devin). Experience with Cursor is a plus, we use it as a team and are open to adopting new tools.\nToku is an equal opportunity employer, and we are committed to being a diverse team that reflects a broad range of background, thought, and experience. We do not discriminate based on race, color, religion, sex, gender identity, sexual orientation, age, national origin, status as an individual with a disability, status as protected veteran, or any other legally protected characteristics. Women, minorities, LGBTQ+, and people from underrepresented backgrounds are strongly encouraged to apply.\nWe strongly encourage you use Rezi.ai to vet resume quality before applying.",
        "url": "https://remoteok.com/remote-jobs/remote-full-stack-software-engineer-toku-1128172"
    },
    {
        "title": "Software Engineer",
        "company": "Tech Innovations Inc.",
        "location": "San Francisco",
        "salary": null,
        "description": "We are looking for a Software Engineer to join our team.\nResponsibilities:\nDevelop and maintain web applications.\nCollaborate with cross-functional teams.\nParticipate in code reviews and contribute to team knowledge sharing.\nQualifications:\nBachelor's degree in Computer Science or related field.\nExperience with JavaScript, HTML, CSS, and React.\nStrong problem-solving skills and attention to detail.\nWe offer competitive salaries and benefits.\nSalary and compensation\n$80,000 — $120,000/year\nLocation\nSan Francisco",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-tech-innovations-inc-1128171"
    },
    {
        "title": "Chief Engineer Spacecraft",
        "company": "Terran Orbital Corporation",
        "location": "Irvine, CA",
        "salary": null,
        "description": "Join a team where your impact reaches beyond the stars! At Terran Orbital, you’re not just part of the system – you’re a vital force propelling our mission forward. As trailblazers in satellite manufacturing and aerospace innovation, we shatter boundaries daily to deliver groundbreaking solutions that power our nation’s defense and commercial missions. We are a unique, fast growing, and trusted team dedicated to swiftly and efficiently designing, building, launching, and operating state of the art satellites for advanced mission constellations. If you’re driven by purpose, inspired by challenges, and ready to leave your mark on the universe, you’ll find a home and endless opportunities for growth here. Together, let’s redefine what is possible in orbit and beyond!\nSummary\nTerran Orbital is seeking an experienced Chief Engineer - Spacecraft to join our growing team as a key leadership team member. Reporting to the VP, Space & Mission Systems, the Chief Engineer - Spacecraft will be a key member of the engineering leadership team that works closely with functional engineering teams and program managers as a technical authority to ensure product integrity that meets customers’ needs with technical excellence. The Chief Engineer will also support the development of solutions, provide input to technical cost proposals, drive affordability, and ensure the technical integrity of delivered products with rigor through design, testing, and technical issue resolution. This role will serve as a technical authority for the organization and provide technical leadership for the development roadmaps, engineering standards, process, and tool development, incorporating best practices and lessons learned across the port.\nSalary and compensation\n$100,000 — $150,000/year\nLocation\nIrvine, CA",
        "url": "https://remoteok.com/remote-jobs/remote-chief-engineer-spacecraft-terran-orbital-corporation-1128167"
    },
    {
        "title": "Senior Fullstack Engineer",
        "company": "Clair",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About Clair\nIf you can send your friends money in seconds, why does it still take your employer two weeks to send your paycheck?\nAt Clair, we are on a mission to create financial freedom for America's workers by giving them a digital banking platform that allows them to get paid as soon as they clock out of work. But we're not just another digital bank or on-demand pay provider. We meet Americans at their place of work by embedding our products within the scheduling, workforce management, and payroll apps they already use every day.\nLearn more about us at getclair.com/about\nAbout the Role\nWe are seeking a world-class Senior Fullstack Engineer who thrives on solving high-impact, complex problems. You will own critical system architecture, shape the future of real-time financial transactions, and build at a massive scale. Your work will directly enable millions of hourly workers to access financial freedom.\nWe operate at the intersection of fintech, embedded finance, and real-time payroll systems—building products that handle millions of transactions with sub-second performance.\nIf you are a problem solver who loves technical challenges, is passionate about performance optimization, security, and scalable architecture, and wants to influence key product decisions, you’ll love working with us.\nKey Responsibilities:\nOwn and architect mission-critical financial applications, ensuring real-time, high-availability performance at scale.\nDesign highly scalable APIs that support millions of transactions, leveraging cutting-edge cloud infrastructure.\nLead high-performance engineering projects from conception to deployment, ensuring code quality, maintainability, and security.\nOptimize transaction processing systems to ensure instant payments and sub-millisecond response times.\nMake key architectural decisions to scale our on-demand pay and embedded finance solutions.\nSet the engineering bar high by leading performance optimizations, security improvements, and system reliability enhancements.\nWork alongside top engineers in a fast-paced, high-impact environment where decisions directly impact millions of users.\nRequired Experience & Qualifications:\n5+ years of experience building, launching, and maintaining scalable fintech products.\nDemonstrated mastery in backend development is required. While proficiency with PHP/Laravel is preferred, candidates with experience in other backend languages and a proven ability to rapidly adapt to new technologies will be considered.\nProficiency in frontend development using React.js, TypeScript, JavaScript (ES6+), and Expo (React Native).\nAppreciation for beautiful, clear code and great developer experience\nAbility to pr\nSalary and compensation\n$100,000 — $150,000/year\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-senior-fullstack-engineer-clair-1128161"
    },
    {
        "title": "Software Engineer Product",
        "company": "GC AI",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About companyGC AI is currently an AI platform for in-house lawyers to 10x themselves. Using the latest LLMs, we are building AI agents that can use company knowledge, leverage external sources, and connect with internal tools to provide better and faster legal advice to the rest of the company. Thousands of weekly active users tell us they “cannot imagine their lives without GC AI” - which has led us to 95% retention and a NPS of 75.This is a once-in-a-generation opportunity to build for a $1T annual market. We have jaw-dropping product-market fit - growing our customer base from 0 to 500+ legal teams in a year and 3X ARR growth in the last 4 months. Join our Series A stage rocket ship backed by top investors like Sound Ventures, Fellows Fund, Guillermo Rauch and Worklife Ventures. GC AI is a small but mighty team of lawyers, engineers, sellers and doers. Here, you’ll have infinite room to grow and rethink how legal work gets done.Come build the future with us.About the role:We're looking for a Software Engineer who's passionate about building products that transform how knowledge work gets done. As a key member of our engineering team, you'll have end-to-end ownership of features that directly impact thousands of lawyers' daily work. You’ll work directly with the founding team on building the future of legal work.\nWhy this role matters:Legal teams today are drowning in work. Our platform changes that, but only if we build it right. You'll be crafting the systems that make sophisticated legal work feel simple and intuitive. Your code won't just ship features - it will fundamentally change how legal teams operate, making their work faster, smarter, and more impactful.\nWhat you'll do:* Design and implement full-stack features that blend elegant UX with robust backend systems.\nArchitect scalable solutions across our entire tech stack (React, TypeScript, Node.js).\nShape our technical direction, making crucial decisions about architecture and infrastructure.\nBuild and optimize cloud-native systems using GCP.\nMentor and uplift other engineers through thoughtful code reviews and knowledge sharing.\nDrive innovation in both our codebase and the legal tech industry as a whole.\nImpact you'll have:* Own mission-critical surfaces end-to-end—from API to UI—that lawyers use daily to review, draft, and advise.\nTurn customer feedback into shippable specs and ship quickly, improving quality while shrinking lead time for change.\nRaise the reliability bar (observability, testing, fallbacks) so complex AI features behave predictably in high-stakes moments.\nHelp build the leading legal AI platform for in-house teams..\nRequired Experience:* 5+ years of experience building production-grade web applications.\nStrong expertise in modern JavaScript/TypeScript.\nDeep understanding of React and frontend architecture.\nExperience with cloud platforms (GCP).\nTrack record of designing scalable backend systems.\nHistory of making architectural decisions that stood the test of time.\nNice to Have:* Experience with modern ORMs (Drizzle/Prisma) and API design.\nKnowledge of DevOps practices.\nBackground in building secure, compliant systems.\nFamiliarity with AI/LLM integrations.\nExperience mentoring other engineers.\nUnderstanding of legal tech or B2B SaaS.\nThe Mindset:* Problem Solver: You come alive tackling complex challenges without obvious solutions.\nOwnership-Driven: You take initiative without needing direction and focus on outcomes.\nContinuous Learner: Your curiosity drives you to constantly level up your engineering skills.\nStartup DNA: You thrive in fast-paced environments where responsibilities evolve.\nWhat we offerGrowth & Impact* Shape the future of a rapidly growing startup\nDirect collaboration with founding team\nReal influence on company strategy and direction\nA voice that matters - your ideas will be heard and implemented﻿\nEnvironment & Benefits* Competitive salary, equity and healthcare\nWe’re a hybrid company — many roles are remote-friendly, while some teams require meeting in person a couple of days a week in the Bay Area office.\nHigh-energy, joyful team environment\nCareer Development* Mentorship and learning opportunities\nClear path for growth in an expanding company\nExposure to cutting-edge technologies and practices\nFreedom to innovate and own crucial systems\nSalary and compensation\n$150,000 — $230,000/year",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-product-gc-ai-1128160"
    },
    {
        "title": "Staff Backend Engineer Product",
        "company": "OnePay",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About OnePayOnePay is a consumer financial services app with an exceedingly simple mission: to help people achieve financial progress.Tens of millions of Americans today are unbanked or underbanked, meaning they don’t have enough money in savings to cover a minor emergency. They pay too much in fees, don’t have access to credit at affordable rates, and have little ability to grow their wealth. OnePay’s vision is to create a single app for consumers to save, spend, borrow, and grow their money, bringing our mission to life with simple and accessible banking, credit, and payments products that deliver a best-in-class experience to millions of customers. Our products include:* Checking and high-yield savings accounts\nDomestic and international peer-to-peer payments\nCredit Builder and credit score monitoring\nDigital wallet / contactless payment solutions\nCredit card program\nBuy-now-pay-later installment loans at Walmart\nPrepaid mobile service\nWhy do we have a right to win? We have the backing of Walmart (a Fortune 1) and Ribbit Capital (a preeminent fintech investor), are deeply embedded with the distribution of the world’s largest omnichannel retailer, and have an industry-leading multi-product value proposition — all in addition to having some of the best people and talent in the industry.There’s never been a better time to build a category-defining business and there has rarely been a team better positioned for the opportunity. Join us!The RoleAs a Staff Engineer at OnePay, you’ll serve as a highly versatile technical leader and contributor, tackling complex engineering challenges across multiple domains. Rather than being tied to a single product or team, you’ll be deployed as a utility player where the business needs you most—whether that’s scaling systems, guiding architectural decisions, or accelerating delivery of user-facing features. You’ll collaborate broadly with engineering, product, and design, and play a pivotal role in shaping OnePay’s technical foundation and customer experience.What You’ll Do* Lead design and implementation of high-scale systems and features across product lines, serving as a trusted technical partner for multiple teams.\nProvide architectural guidance and hands-on contributions to ensure reliability, security, and performance across OnePay’s platform.\nTackle complex, novel engineering problems in areas such as payments, servicing, and consumer-facing experiences.\nMentor and level up other engineers, raising the technical bar across the org.\nContribute to shaping the core infrastructure and developer experience that power our products\nYou Bring* 10+ years of professional software engineering experience, including at least 3 years in a senior or staff-level capacity driving technical outcomes.\nProven success building and scaling user-facing products or backend systems in fast-paced environments.\nProven ability to quickly ramp up across different technical areas and lead complex initiatives, regardless of stack or domain.\nStrong ability to operate autonomously, navigate ambiguity, and quickly align stakeholders.\nBonus: Experience working with AI-powered or user-facing AI products (e.g., personalization, conversational agents, recommendation systems).\nDrive and proactivity – everyone here is a builder and executor.\nTools we useWe use the fp-ts library for functional programming with Node/TypeScript running on top of Kubernetes and AWS. We believe great engineers can learn any stack, so you do not need experience with these specific tools, but you’ll ramp up more quickly if you are familiar with functional programming concepts.What We Offer* Competitive base salary, stock options, and health benefits from Day 1\n401(k) plan with company match\nRemote-friendly (US), flexible time off (FTO), and opportunities for growth\nA high-growth, mission-driven, inclusive culture where your work has real impact\nStandard Interview Process* Initial Interview with Talent Partner\nTechnical or Hiring Manager Interview\nTeam Interview\nExecutive Interview\nOffer!\nEqual Employment OpportunityTo build technology and products that are used and loved by people and solve real-world problems, we need to build a team with many different perspectives and experiences. We are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us at talent@onepay.com.\nSalary and compensation\n$180,000 — $260,000/year\nBenefits\n💰 401(k)",
        "url": "https://remoteok.com/remote-jobs/remote-staff-backend-engineer-product-onepay-1128147"
    },
    {
        "title": "Senior Data Engineer",
        "company": "Blockworks",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About Us:Blockworks is an information platform that sits at the center of the crypto industry. We transform raw, complex data and facts into actionable research, trusted news, alpha-driven insights, and world-class events. The result is transparency and confidence. We enable investors, operators, and institutions to see past the noise, make better decisions, and drive the industry forward.Who You Are:Software engineering is your passion and you have special talents focused on data architecture, design and infrastructure. You are a player-coach and someone who understands the technical and human elements that go into great software design. You have a results-oriented attitude and a passion for delivering flawless releases and developing digital data pipelines. You have a proven track record facilitating engineering teams to increase productivity and quality.You're excited at the possibility of helping design and develop our data pipelines as well as leading leading our Solana data-related projects and strategies. You love moving quickly in a fast-paced start-up, but you also bring intentionality, sustainability and scalability to your approach as an engineer.What You’ll Do:As our Senior Data Engineer, you will be directly responsible for leading the creation and execution of our data models and strategies that feed our product. You'll work collaboratively with other members of the engineering team to design, develop, implement, and evolve our data pipeline and approaches.Every day will look a little different, but in general, you will do things like:* Own Data Sourcing Pipelines: You'll be responsible for helping to architect our data warehousing, ingestion and sourcing strategy, working with multiple SDKs to aggregate data from various sources into Blockwork's own data warehouse.\nDesign and Implement ETL Solutions: You'll be responsible for implementing our overall ETL approach, including accessing & setting up blockchain nodes to pull from, sourcing data from 3rd parties, and modeling our internal schemas across our PostgreSQL database(s)\nGrow Shared Knowledge: You'll help provide technical leadership, guidance, and assistance to the team in the implementation of established architectures and designs.\nDrive Operational Efficiency: You'll be constantly looking for opportunities to improve data workflows and reliably automate routine tasks.\nCross-Functional Collaboration: You'll work with other teams across Blockworks, including Research, Product, and Engineering, to lead initiatives and move collaborations forward.\nExperimentation is frequent at Blockworks. Comfortability with being uncomfortable is a must.What You’ve Done Before:For this role, first and foremost, you must have significant knowledge of the crypto industry; interest in crypto is not enough, we’re looking for someone who considers themself crypto native. You have at least 4 (but ideally more) years of hands-on experience with data modeling, schema design, data operations, and data warehousing. During that time, you've personally built backend systems at scale with a focus on data processing and ingestion. You're an ace at Typescript, Go, and/or Python, and you bring incredibly strong expertise in SQL (ideally Postgres, dbt, and Hypertables). You have deep experience creating data warehouses using Timescale, Snowflake, and/or BigQuery, and you also bring experience using DevOps tools and solutions like Docker, CI/CD, and AWS.It’d Be Great If You’ve Done This:Experience and demonstrated success in crypto, web3, startup, or incubator environments will move you to the top of the list. A background in designing, building, and managing microservices will also set you apart, especially if you bring expertise in security, privacy, and scalability. We’re especially interested in candidates who can pair technical depth with an ability to thrive in high-growth, fast-paced settings.What will truly make you stand out is hands-on experience with Solana. If you’ve built and operated Solana ingestion pipelines using RPC, Websocket, or Geyser with resilience to forks and automated backfills, you’ll be a huge asset to our team. We’re looking for engineers who can decode transactions, instructions, and events, and ship modeled data into Postgres, Clickhouse, or Parquet with speed and accuracy. Fluency in decoding native programs such as System, Stake, SPL Token, Token2022, and Memo, along with Anchor programs, while managing IDLs, Borsh layouts, and maintaining an internal decoder registry, would set you apart as a Solana expert.Salary, Benefits, & How We Work:This is a full time exempt position with an expected salary of $160,000 - $200,000/year.Benefits:Remote-First: We're a remote-first organization with an office in NYC for you to utilize as you please.100% Medical Coverage for You: Close to fully paid medical, dental, and vision insurance for you, and a significant portion covered for your dependents.Flexible PTO: We have a flexible paid time off policy that doesn't limit the number of vacation days you can take.Parental Leave: At Blockworks, all team members are eligible for 14 weeks of fully paid parental leave.Hardware Stipend: Every team member has a stipend to use to purchase the tools and technology that help them be their most productive.Learning & Growth Stipend: Every team member has a stipend to spend on their skill growth and professional development.Career Growth: We prioritize skill growth and career development, and we have a clear, documented structure to take the guesswork out of individual development and career progressionGlobal & Diverse Team: We're a global team, and we're committed to creating an open, inclusive, and diverse work cultureCome build with us; we're just getting started!We know that diversity makes for the best problem-solving and creative thinking. We are dedicated to adding new perspectives to the team and encourage everyone to apply if your experience is close to what we are looking for.Blockworks is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nSalary and compensation\n$160,000 — $200,000/year\nBenefits\n🤓 Vision insurance\n🏖 Paid time off",
        "url": "https://remoteok.com/remote-jobs/remote-senior-data-engineer-blockworks-1128141"
    },
    {
        "title": "Software Engineer",
        "company": "Tech Innovations Inc.",
        "location": "San Francisco",
        "salary": null,
        "description": "We are looking for a Software Engineer to join our team. The ideal candidate will have experience in developing scalable web applications and a passion for technology. Responsibilities include designing, coding, and testing software solutions. You will work closely with product managers and other engineers to deliver high-quality products.\nKey Responsibilities:\nDevelop and maintain web applications\nCollaborate with cross-functional teams\nParticipate in code reviews\nTroubleshoot and debug applications\nQualifications:\nBachelor's degree in Computer Science or related field\n3+ years of experience in software development\nProficiency in JavaScript, HTML, CSS, and frameworks like React or Angular\nStrong problem-solving skills\nBenefits:\nCompetitive salary\nHealth insurance\nFlexible working hours\nOpportunities for professional growth\nSalary and compensation\n$80,000 — $120,000/year\nLocation\nSan Francisco",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-tech-innovations-inc-1128140"
    },
    {
        "title": "Senior Software Engineer Growth Vertical",
        "company": "BitGo",
        "location": "San Francisco",
        "salary": null,
        "description": "BitGo is the leading infrastructure provider of digital asset solutions, delivering custody, wallets, staking, trading, financing, and settlement services from regulated cold storage. Since our founding in 2013, we have focused on enabling our clients to securely navigate the digital asset space. With a global presence and multiple Trust companies, BitGo serves thousands of institutions, including many of the industry's top brands, exchanges, and platforms, and millions of retail investors worldwide. As the operational backbone of the digital economy, BitGo handles a significant portion of Bitcoin network transactions and is the largest independent digital asset custodian, and staking provider, in the world. For more information, visit www.bitgo.com.\nBitGo is looking for a Senior Software Engineer to join our Growth Vertical and help us build the first-time user experience for institutional clients and individuals.\nResponsibilities:\nDesign and build scalable, well abstracted, and robust APIs, libraries, and services to empower our API-first platform.\nOwn functionality and scalability features by taking responsibility from inception to deployment and customer integration.\nExpose and document functionality to the UI, third-party developers, and our internal and external tooling.\nCollaborate with cross-functional teams to define, design, and ship new features.\nWrite clean, maintainable, and efficient code.\nEnsure the performance, quality, and responsiveness of applications.\nIdentify and correct bottlenecks and fix bugs.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nParticipate in code reviews and contribute to a culture of continuous improvement.\nWork closely with product managers, designers, and other engineers to understand and refine product requirements.\nSalary and compensation\n$100,000 — $150,000/year\nLocation\nSan Francisco",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-growth-vertical-bitgo-1128132"
    },
    {
        "title": "Senior Frontend Engineer Scaled React",
        "company": "Zeller",
        "location": "India",
        "salary": null,
        "description": "About the role The Zeller payments team owns the platforms used to make millions of payments to our business customers each month. As one of the fastest growing fintechs in Australia, we are searching for product-minded engineers to craft our user-focused, modern payments and banking platform. As a Senior Frontend Engineer in our payments team, you will play a key role in creating new ways for our customers to accept payments, and build the products they use to move and manage their money. Working within our cross-functional product teams, you should have a drive for technical and product excellence and a desire to lend your skills and leadership to the development of highly visible and mission critical products. What you’ll be doing Zeller’s payments frontend team owns the web platform experience of our merchants and their customers. As part of this team, you will: - Work with designers and product managers to thoughtfully translate product requirements into technical designs,\nSalary and compensation\n$80,000 — $120,000/year\nLocation\nIndia",
        "url": "https://remoteok.com/remote-jobs/remote-senior-frontend-engineer-scaled-react-zeller-1128125"
    },
    {
        "title": "Graduate Software Engineer",
        "company": "Select Labs Inc",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About the roleSELECT is expanding the engineering team to scale with our growing customer base and features to build.We’re looking for strong technical generalists to contribute to our core product and help us build the foundation for our rapidly expanding company.Wide-ranging curiosity and enthusiasm for diving into abstract problems, coming up with good solutions, and seeing them through to completion is essential. You'll go from idea to live pixels in front of a user every week.What's SELECT?Founded in 2022, SELECT was born out of our desire for a product to find opportunities to optimize and make managing cloud data costs easier. After a period of research and consultation with other practitioners, we learned we weren't alone in wanting such a thing, so we set about building SELECT. Skipping forward to today, SELECT has over 200 customers, with a product built by a super-motivated, lean team talking to and shipping new features for our customers every single week.What would I be working on?We prioritise ruthlessly toward delivering value for our customers and make high-leverage investments. As a graduate product engineer, you would work alongside a few other engineers to:* Work with our senior engineers to build features from start to finish - from inputting into initial design and planning all the way through to implementation, testing, and delivery\nUse your expertise to iterate at speed, relying on strong instincts to pragmatically drive the right outcomes while balancing speed and depth.\nSet a high bar for collaboration, communication, and sound decision making. From well-written proposals and documentation to clear commit messages and thorough testing\nThe kinds of features the team work on include:* Creating new cost management features such as forecasts, anomaly alerts and cost allocations to make staying on top of costs a breeze\nIntegrating with new platforms\nDeveloping reusable and robust UI components to make the cost exploration experience as seamless as possible\nBuilding new data visualization capabilities to communicate performance, query timing and efficiency in novel ways\nBuilding data pipelines and dbt models to surface new insights and opportunities to our users\nImproving the reliability & performance of our application\nCheck out our changelog and documentation for examples of actual features we're shipping.What does success look like in the role?* Building a deep understanding of our product and the problems our customers face\nOwning features from conception to completion by talking to customers, planning and getting input from other team members, then building, testing and delivering an exception product experience\nCaring deeply about the quality and standard of work\nBalancing that with working quickly and staying focused on the goal\nActively communicating and collaborating with the team\nWhat's the stack?We chose our stack to be both modern and battle-tested.Frontend* Typescript\nReact.js\nNext.js\nTailwind CSS\nBackend* Python\nFastAPI\nPostgres\nSnowflake\nOther* Terraform\nGoogle Cloud Platform (GCP)\ndbt\ndagster\nWhat does the role require?* Based in Canada, the United States or United Kingdom\nSelf-motivation - the folks who succeed here are intrinsically motivated by doing great work\nNice to Haves* Experience with the problems we're solving (FinOps and cloud infrastructure cost management, data warehouse management and observability)\nExperience with our stack\nExperience working in an early-stage startup environment\nAnything else I should know?* We are fully remote, though aim to work as collaboratively as possible.\nOur standups are asynchronous to prioritise deep work, with ad-hoc code pairing sessions throughout the day.\nWe get together in person twice per year, once in Toronto and once somewhere sunny!\nApplication process* The process is fully remote and all communication will happen over email or via video chat. Once you've submitted your application, the team will review your submission for suitability, and if it is suitable, invite you to a short screening interview over video call.\nIf you pass the screen you will be asked to complete a technical interview, with some live coding and discussion of previous projects you've worked on.\nWe aim to screen, interview, send and finalize an offer within 2 weeks of application.\nBenefits\n⏰ Async",
        "url": "https://remoteok.com/remote-jobs/remote-graduate-software-engineer-select-labs-inc-1128121"
    },
    {
        "title": "Software engineer",
        "company": "Sticker Mule",
        "location": null,
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-sticker-mule-1093738"
    },
    {
        "title": "Javascript Fullstack Engineer Senior",
        "company": "Lumenalta",
        "location": null,
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-javascript-fullstack-engineer-senior-lumenalta-1092919"
    },
    {
        "title": "Software Engineer Risk",
        "company": "OnePay",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About OnePayOnePay is a consumer financial services app with an exceedingly simple mission: to help people achieve financial progress.Tens of millions of Americans today are unbanked or underbanked, meaning they don’t have enough money in savings to cover a minor emergency. They pay too much in fees, don’t have access to credit at affordable rates, and have little ability to grow their wealth. OnePay’s vision is to create a single app for consumers to save, spend, borrow, and grow their money, bringing our mission to life with simple and accessible banking, credit, and payments products that deliver a best-in-class experience to millions of customers. Our products include:* Checking and high-yield savings accounts\nDomestic and international peer-to-peer payments\nCredit Builder and credit score monitoring\nDigital wallet / contactless payment solutions\nCredit card program\nBuy-now-pay-later installment loans at Walmart\nPrepaid mobile service\nWhy do we have a right to win? We have the backing of Walmart (a Fortune 1) and Ribbit Capital (a preeminent fintech investor), are deeply embedded with the distribution of the world’s largest omnichannel retailer, and have an industry-leading multi-product value proposition — all in addition to having some of the best people and talent in the industry.There’s never been a better time to build a category-defining business and there has rarely been a team better positioned for the opportunity. Join us!The RoleAs a Software Engineer on the Risk team, your work will directly impact the systems that protect our customers and company. You will:* Build resilient backend services that power fraud detection, identity verification, and transaction monitoring at scale.\nDevelop, test, and maintain backend services and APIs that enable real-time risk and fraud prevention.\nPartner with product managers, and other engineers to design and deploy systems that protect customer accounts and transactions.\nImplement integrations with third-party risk and compliance platforms, ensuring seamless and secure data flows.\nContribute to architectural decisions that balance scale, security, and reliability across sensitive financial systems.\nBuild clear documentation to support collaboration, transparency, and operational excellence.\nYou Bring* 3+ years of professional experience in backend engineering, ideally within fintech, payments, or external customer facing systems.\nProficiency in building and maintaining APIs, microservices, and distributed systems.\nFamiliarity with cloud infrastructure (AWS, Kubernetes, or similar) and database technologies.\nExperience working with risk, fraud, or compliance systems is a plus.\nDrive and proactivity – everyone here is a builder and executor.\nTools We UseWe use the fp-ts library for functional programming with Node/TypeScript running on top of Kubernetes and AWS. We believe great engineers can learn any stack, so you do not need experience with these specific tools, but you’ll ramp up more quickly if you are familiar with functional programming concepts.What We Offer* Competitive base salary, stock options, and health benefits from Day 1\n401(k) plan with company match\nRemote-friendly (US), flexible time off (FTO), and opportunities for growth\nA high-growth, mission-driven, inclusive culture where your work has real impact\nStandard Interview Process* Initial Interview with Talent Partner\nTechnical or Hiring Manager Interview\nTeam Interview\nExecutive Interview\nOffer!\nEqual Employment OpportunityTo build technology and products that are used and loved by people and solve real-world problems, we need to build a team with many different perspectives and experiences. We are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us at talent@onepay.com.\nSalary and compensation\n$130,000 — $160,000/year\nBenefits\n💰 401(k)",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-risk-onepay-1128120"
    },
    {
        "title": "Senior Solidity Engineer",
        "company": "GenLayer Labs Corp",
        "location": "Spain",
        "salary": null,
        "description": "GenLayer Labs Corp is hiring Senior Solidity Engineer, Full-Time, Spain. Apply now! Find the latest jobs in the Web3 & blockchain industry on cryptojobs.com.\nSalary and compensation\n$60,000 — $120,000/year\nLocation\nSpain",
        "url": "https://remoteok.com/remote-jobs/remote-senior-solidity-engineer-genlayer-labs-corp-1128118"
    },
    {
        "title": "Senior Software Engineer Database Optimizer",
        "company": "Cast AI",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Remote - About the roleCast AI is seeking a skilled senior software engineer with deep expertise in databases. It’s more about understanding database underlying technology than just knowing how to use it.Knowing the implementation details on transactions, wire protocol, Wâ€¦\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Golang, Senior and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $65,000 — $140,000/year",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-database-optimizer-cast-ai-1128072"
    },
    {
        "title": "Senior Software Engineer Billy Team",
        "company": "Cast AI",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Remote - Why Cast AI?Cast AI is the leading Application Performance Automation (APA) platform, enabling customers to cut cloud costs, improve performance, and boost productivity – automatically.Built originally for Kubernetes, Cast AI goes beyond cost and observability byâ€¦\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Golang, Senior and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $65,000 — $140,000/year",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-billy-team-cast-ai-1128074"
    },
    {
        "title": "Security Engineer",
        "company": "Galaxy",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Who We Are:\nGalaxy is a global leader in digital assets and data center infrastructure, delivering solutions that accelerate progress in finance and artificial intelligence. We believe that blockchain and digital asset innovation will transform how value moves through the world – and we’re building the products and services to make that future a reality.\n \nOur institutional digital assets platform spans trading, investment banking, asset management, staking, self-custody, and tokenization technology. We also invest in and operate cutting-edge data center infrastructure to power AI and high-performance computing, addressing the growing demand for scalable energy and compute in the U.S.\n \nWe work at the intersection of finance and technology, helping institutions, startups, and developers navigate a digitally native economy. Led by CEO and Founder Michael Novogratz, our team blends deep crypto expertise with institutional experience and a shared commitment to shaping the future of Web3 and AI.\n \nGalaxy is headquartered in New York City, with offices across North America, Europe, the Middle East, and Asia.\n \nTo learn more about our businesses and products, visit www.galaxy.com.\nWhat We Value:\nWe are a diverse team of free thinkers, and fast movers united to help investors and creators energize the global economy. We are looking for individuals who thrive in a culture of builders and overachievers and embrace high performance, transparent feedback, and a mission-first approach. Our culture shapes our way of working and gets us where we want to be.\nSeek Excellence.\nBe Selective To Be Effective.\nBe Highly Aligned, Loosely Coupled.\nDisagree Transparently.\nEncourage Independent Decision-Making.\nBuild Dream Teams.\nWho You Are:\nWe are seeking a Security Engineer to join our Security Operations Center (SOC) team. This role will focus on developing, maintaining, and optimizing detection use cases, threat hunting queries, and response automation within our SOC environment. The SOC Security Engineer will play a critical role in enhancing our detection and response capabilities, ensuring we stay ahead of emerging threats and continuously strengthen our security posture.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Crypto, Finance and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $57,500 — $120,000/year\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-security-engineer-galaxy-1127837"
    },
    {
        "title": "Senior Backend Engineer",
        "company": "Dacr",
        "location": null,
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-senior-backend-engineer-dacr-1122247"
    },
    {
        "title": "Frontend + UX Designer",
        "company": "Vercept",
        "location": "🇺🇸 United States",
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-frontend-ux-designer-vercept-1119908"
    },
    {
        "title": "Senior Full stack Developer",
        "company": "Lemon.io",
        "location": "🇦🇱 Albania",
        "salary": null,
        "description": null,
        "url": "https://remoteok.com/remote-jobs/remote-senior-full-stack-developer-lemon-io-1112254"
    },
    {
        "title": "Software Engineer Gauntlet App",
        "company": "Gauntlet",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Gauntlet leads the field in quantitative research and optimization of DeFi economics. We manage market risk, optimize growth, and ensure economic safety for protocols facilitating most spot trading, borrowing, and lending activity across all of DeFi, protecting and optimizing the largest protocols and networks in the industry. As of April 2025, Gauntlet manages risk and incentives covering over $42 billion in customer TVL.\nGauntlet continually publishes cutting-edge research that informs our risk models, alerts, and analysis, and is among the most cited institution — including academic institutions — in terms of peer-reviewed papers addressing DeFi as a subject. We’re a Series B company with around 75 employees, operating remote-first with a home base in New York City.\nGauntlet’s mission is to drive adoption and understanding in the financial systems of the future. Building with decentralized systems creates novel challenges for mechanism designers, smart contract developers, and end-users of financial products, which are not seen in traditional software development and investing contexts. Gauntlet is dedicated to enhancing our industry’s understanding of this new domain and revealing how to safely navigate the true bleeding edge of 21st-century financial innovation.\nGauntlet App:\nJoin a newly formed product pod focused on the Gauntlet App — our next-generation dApp that allows users to deposit and withdraw into vaults directly. This role is part of a critical initiative to evolve our dashboard into a product directly connected to revenue. You'll be working on a high-impact project tightly aligned with Gauntlet’s core strategy, helping build a robust, user-facing experience at the heart of our business.\nResponsibilities\nLead the design, development, and maintenance of full-stack features for Gauntlet’s decentralized application, ensuring high performance and scalability\nPartner closely with front-end engineers to deliver cohesive and well-integrated user experiences\nProvide technical leadership and mentorship to other engineers, fostering collaboration and knowledge sharing\nEngage in systems design and architecture discussions to build robust backend services supporting the application\nParticipate actively in code reviews and design sessions, promoting best practices and high-quality code standards\nCollaborate with product managers and researchers to translate requirements into effective technical solutions\nDiagnose, troubleshoot, and resolve complex software issues to maintain system reliability and performance\nQualifications\n5+ years of professional experience in software development, with a focus on full-stack engineering.\nStrong proficiency in TypeScript for full-stack development\nProven ability to design and implement user-centric applications, emphasizing seamless user experiences.\nSolid experience with backend systems and APIs, including systems design and architecture\nFamiliarity with Python or the ability to be language agnostic\nProven ability to collaborate effectively with others engineers and mentor team members\nExcellent problem-solving and analytical skills with a focus on application development lifecycle\nStrong communication skills and the ability to work collaboratively in a distributed team environment\nBonus Points\nInterest or experience in DeFi concepts like decentralized applications (dApps) and on-chain interactions\nFamiliarity with financial technology (fintech) products and user experiences.\nPrevious work on applications that handle monetary transactions or sensitive user data.\nFamiliarity with application development lifecycle from end to end\nExperience developing and shipping user-facing features using component-based UI frameworks such as React\nHistory utilizing, at any level, technologies and languages like Solidity or Rust\nExperience working in smaller teams or startups, demonstrating broad technical versatility\nBackground working with data pipelines or tooling, including ETL processes, orchestration tools and integrating data flows in production environments\nBenefits and Perks\nRemote first - work from anywhere in the US & CAN!\nCompetitive packages with the added opportunity for incentive-based compensation\nRegular in-person company retreats and cross-country \"office visit\" perk\n100% paid medical, dental and vision premiums for employees\nLaptop provided\n$1,000 WFH stipend upon joining\n$100 per month reimbursement for fitness-related expenses\nMonthly reimbursement for home internet, phone, and cellular data\nUnlimited vacation policy\n100% paid parental leave of 12 weeks\nFertility benefits\nPlease note at this time our hiring is reserved for potential employees who are able to work within the contiguous United States and Canada. Should you need alternative accommodations, please note that in your application.\nThe national pay range for this role is $165,000 - $205,000 plus additional On Target Earnings potential by level and equity in the company.  Our salary ranges are based on paying competitively for a company of our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide. Individual pay rate decisions are based on a number of factors, including qualifications for the role, experience level, skill set, and balancing internal equity relative to peers at the company.\nLI-Remote\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Solidity, Python, Typescript, Engineer and Backend jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $147,500/year\nBenefits\n🌎 Distributed team\n🏖 Unlimited vacation\n🏔 Company retreats\nLocation\nNew York City / San Francisco / Los Angeles / Remote",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-gauntlet-app-gauntlet-1095415"
    },
    {
        "title": "Senior Engineer Production Operations",
        "company": "Greenlight Financial Technology",
        "location": "Atlanta (Remote Friendly)",
        "salary": null,
        "description": "Greenlight is the leading family fintech company on a mission to help parents raise financially smart kids. We proudly serve more than 6 million parents and kids with our award-winning banking app for families. With Greenlight, parents can automate allowance, manage chores, set flexible spend controls, and invest for their family’s future. Kids and teens learn to earn, save, spend wisely, and invest.\nAt Greenlight, we believe every child should have the opportunity to become financially healthy and happy. It’s no small task, and that’s why we leap out of bed every morning to come to work. Because creating a better, brighter future for the next generation depends on it.\nAs a Senior Engineer, you will be a key individual contributor within our Production Operations team. You will be instrumental in designing, building, and maintaining highly reliable, scalable, and performant cloud infrastructure and systems that support Greenlight's mission-critical services. This role is for a seasoned engineer who thrives on solving complex operational challenges, enhancing system stability, and improving efficiency through automation and best practices.\nYour day-to-day:\nContribute to the design, implementation, and maintenance of Greenlight's core cloud infrastructure and Site Reliability Engineering (SRE) practices to ensure high availability, scalability, and performance.\nDevelop, maintain, and optimize our cloud infrastructure using Infrastructure as Code (primarily Terraform) and other automation tools.\nCollaborate closely with development and security teams to embed SRE principles into the software development lifecycle, promoting secure and reliable coding practices.\nDesign and implement robust monitoring, logging, and alerting solutions to provide comprehensive visibility into system health.\nActively participate in and support incident response, performing deep-dive root cause analysis, and contributing to actionable blameless postmortems to prevent recurrence.\nIdentify and implement architectural improvements to enhance system reliability, resilience, and operational efficiency.\nAutomate operational tasks and processes to reduce toil and improve efficiency.\nResearch, evaluate, and advocate for new technologies and tools that can improve our operational posture and efficiency.\nEnhance existing services and applications to increase availability, reliability, and scalability in a microservices environment.\nBuild and improve engineering tooling, processes, and standards to enable faster, more consistent, more reliable, and highly repeatable application delivery.\nWhat you’ll bring to the team:\n5+ years of experience in a Site Reliability Engineering, Production Operations, or similar role, with a strong focus on cloud infrastructure and distributed systems.\nProven experience architecting, building, and maintaining highly available, secure, and scalable systems in a public cloud environment (AWS strongly preferred).\nStrong proficiency with IaC tools, particularly Terraform.\nDemonstrated experience in automating operational tasks using scripting languages (e.g., Python, Go, Bash) and automation platforms.\nExpertise in designing and implementing comprehensive monitoring, logging, and alerting solutions (e.g., Datadog, Prometheus, Grafana, ELK stack).\nSolid understanding of incident response best practices, with experience in troubleshooting and resolving complex production issues.\nStrong understanding of distributed systems, microservices architectures, and containerization technologies (Docker, Kubernetes/EKS).\nExceptional analytical and problem-solving skills, with a track record of debugging complex issues in production environments.\nExcellent communication, collaboration, and interpersonal skills. Ability to clearly articulate technical concepts to both technical and non-technical audiences.\nA passion for identifying and implementing improvements in system reliability, performance, and operational efficiency.\nBonus Points If You Have:\nExperience with payments infrastructure or other high-volume transactional systems.\nFamiliarity with database technologies (e.g., PostgreSQL, Cassandra, DynamoDB).\nExperience with continuous integration/continuous delivery (CI/CD) pipelines.\nWork perks at Greenlight:\nMedical, dental, vision, and HSA match\nPaid life insurance, AD&D, and disability benefits\nTraditional 401k with company match\nUnlimited PTO\nPaid company holidays and pop-up bonus holidays\nProfessional development stipends\nMental health resources\n1:1 financial planners\nFertility healthcare\n100% paid parental and caregiving leave, plus cleaning service and meals during your leave\nFlexible WFH, both remote and in-office opportunities\nFully stocked kitchen, catered lunches, and occasional in-office happy hours\nEmployee resource groups\nOur stance on salaries:\nGreenlight provides a competitive compensation package with a market-based approach to pay and will vary depending on your location, experience and skill set. The total compensation package for this position will also include a discretionary performance bonus, equity rewards, medical benefits, 401K match, and more. Greenlight conducts continuous compensation evaluations across departments and geographies to ensure we are keeping our pay current and competitive.\nThe estimated base pay range for this position in (NY, CA, WA): $152,000- 185,000\nThe estimated base pay range for this position in (CO): $152,000- 177,000\nWho we are:\nIt takes a special team to aim for a never-been-done-before mission like ours. We’re looking for people who love working together because they know it makes us stronger, people who look to others and ask, “How can I help?” and then “How can we make this even better?” If you’re ready to roll up your sleeves and help parents raise a financially smart generation, apply to join our team.\nGreenlight is an equal opportunity employer and will not discriminate against any employee or applicant based on age, race, color, national origin, gender, gender identity or expression, sexual orientation, religion, physical or mental disability, medical condition (including pregnancy, childbirth, or a medical condition related to pregnancy or childbirth), genetic information, marital status, veteran status, or any other characteristic protected by federal, state or local law.\nGreenlight is committed to an inclusive work environment and interview experience. If you require reasonable accommodations to participate in our hiring process, please reach out to your recruiter directly or email recruiting@greenlight.me.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Finance, Senior and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $145,000/year\nBenefits\n💰 401(k)\nLocation\nAtlanta (Remote Friendly)",
        "url": "https://remoteok.com/remote-jobs/remote-senior-engineer-production-operations-greenlight-financial-technology-1095227"
    },
    {
        "title": "Big Data Engineer Professional Services",
        "company": "BrightEdge",
        "location": "Hyderabad",
        "salary": null,
        "description": "About Us\nBrightEdge is a leading SEO and content performance marketing platform that transforms online content into tangible business results. Our platform processes massive amounts of data to provide actionable insights to our clients. We're looking for a talented Big Data Engineer to join our Professional Services to help us scale and optimize our data processing capabilities. \nRole Overview \nAs a Big Data Engineer at BrightEdge, you will design, build, and maintain high-performance data pipelines that process terabytes of data. You'll work on optimizing our existing systems, identifying and resolving performance bottlenecks, and implementing solutions that improve the overall efficiency of our platform. This role is critical in ensuring our data infrastructure can handle increasing volumes of data while maintaining exceptional performance standards.\nKey Responsibilities\nDesign and implement scalable batch processing systems using Python and big data technologies\nOptimize database performance, focusing on slow-running queries and latency improvements\nUse Python profilers and performance monitoring tools to identify bottlenecks\nReduce P95 and P99 latency metrics across our data platform\nBuild efficient ETL pipelines that can handle large-scale data processing\nCollaborate with data scientists and product teams to understand data requirements\nMonitor and troubleshoot data pipeline issues in production\nImplement data quality checks and validation mechanisms\nDocument data architecture and engineering processes\nStay current with emerging big data technologies and best practices\nQualifications\nRequired\nBachelor's degree in Computer Science, Engineering, or related technical field\n4+ years of experience in data engineering roles\nStrong Python programming skills with focus on data processing libraries\nExperience with big data technologies (Spark, Hadoop, etc.)\nProven experience optimizing database performance (SQL or NoSQL)\nKnowledge of data pipeline orchestration tools (Airflow, Luigi, etc.)\nUnderstanding of performance optimization techniques and profiling tool\nPreferred\nMaster's degree in Computer Science or related field\nExperience with SEO data or web crawling systems\nExperience with Clickhouse Database\nKnowledge of distributed systems and microservices architecture\nFamiliarity with container orchestration (Kubernetes, Docker)\nExperience with real-time data processing\nContributions to open-source projects\nExperience with machine learning operations\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Python, SEO, Marketing and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $130,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nHyderabad",
        "url": "https://remoteok.com/remote-jobs/remote-big-data-engineer-professional-services-brightedge-1094983"
    },
    {
        "title": "Principal Data Engineer",
        "company": "PEXA Group",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Hi, we’re Smoove, part of the PEXA Group.\nOur vision is to simplify and revolutionise the home moving and ownership experience for everyone. We are on a mission to deliver products and services that remove the pain, frustration, uncertainty, friction and stress that the current process creates.\nWe are a leading provider of tech in the property sector - founded in 2003, our product focus has been our conveyancer two-sided marketplace, connecting consumers with a range of quality conveyancers to choose from at competitive prices via our easy-to-use tech platform. We are now building out our ecosystem so consumers can benefit from our services either via their Estate Agent or their Mortgage Broker, through smarter conveyancing platforms, making the home buying or selling process easier, quicker, safer and more transparent\nWhy join Smoove?\nGreat question! We pride ourselves on attracting, developing and retaining a diverse range of people in an equally diverse range of roles and specialisms – who together achieve outstanding results. Our transparent approach and open-door policy make Smoove a great place to work and as our business expands, we are looking for ambitious, talented people to join us.\nWe are seeking an experienced Principal Data Engineer to define, lead, and scale the technical strategy of our data platform. This is a senior, hands-on leadership role at the intersection of architecture, governance, and engineering excellence, where you will shape how data is collected, processed, and delivered across the organisation.\nYou will own the end-to-end quality, performance, and scalability of our data systems — from raw ingestion through to trusted datasets powering business-critical analytics and reporting. This includes setting standard sand influencing the strategic roadmap for data infrastructure.\nOur stack is built on both AWS and Azure, using Databricks across data domains and you will lead the evolution of this ecosystem to meet future business needs.\nYou’ll ensure that data is secure, compliant, discoverable, and business-ready, enabling analysts, data scientists, and stakeholders to make confident, data-driven decisions.\nThis role is ideal for a highly technical leader who thrives at both the strategic and execution levels: someone equally comfortable defining architecture with executives, mentoring senior engineers, and optimising distributed pipelines at scale.\nRole Responsibilities\nDesign and oversee scalable, performant, and secure architectures on Databricks and distributed systems.\nAnticipate scaling challenges and ensure platforms are future-proof.\nLead the design and development of robust, high-performance data pipelines using PySpark and Databricks.\nDefine and ensure testing frameworks for data workflows.\nEnsure end-to-end data quality from raw ingestion to curated, trusted datasets powering analytics.\nEstablish and enforce best practices for data governance, lineage, metadata, and security controls.\nEnsure compliance with GDPR and other regulatory frameworks.\nAct as a technical authority and mentor, guiding data engineers.\nInfluence cross-functional teams to align on data strategy, standards, and practices.\nPartner with product, engineering, and business leaders to prioritise and deliver high-impact data initiatives.\nBuild a culture of data trust, ensuring downstream analytics and reporting are always accurate and consistent.\nEvaluate and recommend emerging technologies where they add value to the ecosystem.\nSkills & Experience Required\nBroad experience as a Data Engineer including technical leadership\nBroad cloud experience, ideally both Azure and AWS\nDeep expertise in PySpark and distributed data processing at scale.\nExtensive experience designing and optimising in Databricks.\nAdvanced SQL optimisation and schema design for analytical workloads.\nStrong understanding of data security, privacy, and GDPR/PII compliance.\nExperience implementing and leading data governance frameworks.\nProven experience leading the design and operation of a complex data platform.\nTrack record of mentoring engineers and raising technical standards.\nAbility to influence senior stakeholders and align data initiatives with wider business goals.\nStrategic mindset with a holistic view of data reliability, scalability, and business value.\n£70,000 - £90,000 a year\nSound like you? \nWe at Smoove are ready so if this role sounds like you, apply today. \n \nTo be conducted as part of post offer employment checks:\nThe personal information we have collected from you will be shared with Cifas who will use it to prevent fraud, other unlawful or dishonest conduct, malpractice, and other seriously improper conduct. If any of these are detected, you could be refused certain services or employment. Your personal information will also be used to verify your identity. Further details of how your information will be used by us and Cifas, and your data protection rights, can be found at [Cifas].\nGDPR Compliance \nDigital Completion UK Limited (trading name “PEXA”), Optima Legal Services Limited (trading name \"Optima Legal\") and Smoove Limited (a holding company which comprises of the following wholly owned trading Subsidiary companies: United Legal Services Limited, United Home Services Limited, Legal-Eye Limited, and Amity Law Limited) are all owned directly by DigCom UK Holdings Limited, which is a wholly owned Subsidiary of PEXA Group Limited in Australia (ACN 140 677 792; ASX: PXA) (referred to collectively as “PEXA Group”).\nWhen we process your applicant personal data for recruitment purposes, we do so as a controller. If as part of the recruitment process, we share your personal data with another company within the PEXA Group, that company may process your personal data as either an independent controller or, in certain circumstances, a joint controller. By applying for this role, you consent to us processing your personal data in accordance with the UK General Data Protection Regulation (\"UK GDPR\") and the Data Protection Act 2018, and further information can be found in our privacy noticehttps://pexa.co.uk/applicant-policy/.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Senior, Legal and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $65,000 — $150,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)",
        "url": "https://remoteok.com/remote-jobs/remote-principal-data-engineer-pexa-group-1094864"
    },
    {
        "title": "Wattpad Senior Engineer",
        "company": "WEBTOON Entertainment Inc. (Wattpad & WEBTOON Family of Brands)",
        "location": "🇨🇦 Canada",
        "salary": null,
        "description": "Wattpad’s vision is to entertain and connect the world through webnovel stories. Since 2006, we’ve been on a mission to use the power of community and technology to unleash the full potential of stories to the world. Representing a tapestry of cultures and languages, people around the world come to Wattpad every month to share and discover stories they can’t find anywhere else. Come build the future of entertainment and storytelling with our global team, and write your next chapter with us!\nWattpad is part of the WEBTOON family of brands, the largest storytelling platform in the world that enables creators and users to discover, create, and share stories. With over 24 million creators and ~170 million active users per month, we are truly empowering creation by anyone, for everyone. To read more about our family of Brands, check out our website here.\nYou will be joining the Core Platforms team. You'll get the opportunity to create and work on the backend platform and systems that power Wattpad. The purpose of the team is to establish a robust set of centralized tools that backend developers can use to implement secure, performant, consistent code quickly to increase the productivity and happiness of Wattpad engineers. You will be creating new tools, defining architectural best practices and creating frameworks for engineers to follow. Our technology creates capabilities to understand stories and users and accelerates our ability to innovate at Wattpad.\nWattpad runs on a large distributed system that handles 45k requests every second. You’ll be assisting in modernizing our backend platform and systems which currently include our monolith, microservices and backend infrastructure. Our monolith is written in PHP and backed by S3, Redis, Memcache, MySQL and Cloudflare. Our microservices are written in Go and are backed by S3, DynamoDB and MySQL. At this scale, caching is paramount so we have multiple terabytes of data across memcached, redis and groupcache.\nWhat you’ll be doing:\nDesigning, building, and maintaining functionality on a large-scale distributed system serving millions of people per day.\nWriting new features, tools and services in Go and PHP.\nImproving reliability and performance of core components and existing systems.\nWriting unit and service tests for all your code.\nDefining best practices and providing mentorship and support to other engineers.\nResearching and implementing new technology to solve tomorrow’s scaling issues.\nAdvocating for the adoption of tools across the engineering org.\nWhat we're looking for:\n5-7+ years of experience in a prior software development role\nYou have experience with monitoring distributed systems at scale\nYou develop scalable, robust, and maintainable code and fault-tolerant services/systems\nYou are skilled in Go and PHP\nYou’ve worked with cloud platforms as a service (AWS, GCP, etc.) for at least 3 years\nYou know how to use Docker\nYou’ve used container orchestration tools like Kubernetes or ECS\nYou have experience in comprehending complex, custom-built codebases, and a history of thorough feature testing and migration\nYou’re comfortable debugging systems at different layers of the stack\nYou are comfortable in both static and dynamic languages and don’t mind switching between them\nYou enjoy working with a team but have no problem working independently\nNothing makes you happier than a hard problem solved well (and has “just the right” amount of documentation)\nYou have or are currently mentoring other developers\nYou have provided technical leadership on initiative(s) involving 2+ other engineers\nBonus Points For:\nYou have exposure to Infrastructure-as-code tools such as Terraform & Ansible\nHands-on experience with CI systems such as TravisCI\nPassionate about security and privacy\nWhat we offer:\nCareer development; we believe in mentorship and investing in your learning, supporting you to achieve your goals\nTop industry health benefits, including vision and dental\nYour own health/wellness account to spend each year\nRRSP Contributions (Canada), 401K Contributions (USA)\nGenerous vacation and Maternity/Parental leave top-up program\nCorporate discount for gym memberships for you and your family\nWork from almost anywhere in the world for part of the year\nWinter break shutdown and a whole lot more!\n$120,000 - $160,000 a yearPlease note, this range is listed in CAD.\nWattpad is conducting all interviews in a distributed manner using applicable third party software where needed and using visual interface tools such as Google Meet and Zoom.\nAbout Wattpad\nWho are we? Entrepreneurs and Do-ers. Our vision is to entertain and connect the world through stories, and our mission is to use the power of community and technology to unleash the full potential of stories to the world.\nWhat does that mean? We are visionaries, community builders, passionate problem solvers, storytellers, coffee snobs (tea drinkers, too!), curious by nature, and culturally diverse.\nWhat are we obsessed with? Our users. Solving complex problems and maximizing flow. Learning constantly. Building the next great storytelling product. Finding the greatest stories ever told. Dogs (and cats), coffee, and good snacks.\nHow do we work? Autonomously, collaboratively, respectfully. Balancing with work, family, and playâ€¦and all while having a great time.\nWattpad is a remote friendly company and encourages remote candidates to apply as long as they are located and authorized to work in either the US or Canada (excluding Quebec) as a precondition of employment. We are not able to sponsor applicants for work permits.\nIf you happen to live near the areas of either Toronto, Ontario or Halifax, Nova Scotia, you may also have the opportunity to work from our beautiful offices - 1 located in Downtown Toronto and the other in Halifax.\nCulture and Diversity\nWattpad is an equal opportunity employer. We do not discriminate. Period.\nWattpad welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We have taken a leadership position on creating a culture and an organization that truly values diversity. We are committed to fostering a global team that reflects the diversity of the Wattpad community. At Wattpad, we believe cultural fit doesn’t mean culturally identical, and diversity of thought helps us to challenge one another to think big and think differently. We consider employment applicants without regard to age, race, colour, national origin, citizenship, religion, creed, sex, sexual orientation, veteran status, marital status, disability status or any other protected status.\nIf you have any special needs or accessibility requirements, please let us know. We will do our utmost to accommodate, in accordance with applicable local legislation.\nDon’t meet all the requirements? Studies show women and people of colour are less likely to apply to jobs if they do not meet all the qualifications. Therefore, in an effort to build a more diverse workplace, we encourage you to apply anyways. You might actually be the right person or you may be a good fit for a number of other openings we currently have.\nWattpad\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Redis, PHP, Senior, Engineer and Backend jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $140,000/year\nBenefits\n💰 401(k)\nLocation\nToronto, Ontario",
        "url": "https://remoteok.com/remote-jobs/remote-wattpad-senior-engineer-webtoon-entertainment-inc-wattpad-amp-webtoon-family-of-brands-1093906"
    },
    {
        "title": "Software Engineer React",
        "company": "3Pillar",
        "location": "🇮🇳 India",
        "salary": null,
        "description": "We are 3PILLAR GLOBAL\nWe build breakthrough software products that power digital businesses. We are an innovative product development partner whose solutions drive rapid revenue, market share, and customer growth for industry leaders in Software and SaaS, Media and Publishing, Information Services, and Retail.\n \nOur key differentiator is our Product Mindset. Our development teams focus on building for outcomes and all of our team members around the globe are trained on the Product Mindset’s core values – Minimize Time to Value, Solve For Need, and Excel at Change. Our teams apply this mindset to build digital products that are customer-facing and revenue-generating. Our business-minded approach to agile development ensures that we align to client goals from the earliest conceptual stages through market launch and beyond.\nIn 2024, 3Pillar Global India was named as a “Great Place to Work” for the sixth year in a row based on how our employees feel about our company, collaborative culture, and work/life balance - come join our growing team\nResponsibilities\nFacilitate effective communication with client project stakeholders regarding project status and recommendations.\nCraft client code that is not just efficient, but also performant, testable, scalable, secure, and of the highest quality.\nActively participate in accurate planning and estimation efforts, utilizing project methods and tools.\nProficiently gather requirements and organize/present developed features for clients.\nExecute complex activities within the current methodology and quality standards, showcasing success across diverse engagements.\nPromote client success across the team by collaborating with engineers, designers, and managers to understand user pain points, anticipate potential problems, and iterate on solutions that drive client success.\nEngage in agile software development, including daily stand-ups, sprint planning, team retrospectives, and other governance activities.\nActively participate in the Engineering Practice community, mentoring others through Communities of Practice (CoPs) or on project teams, and supporting the growth of technical capabilities.\nIndependently drive project delivery within defined architecture, demonstrating autonomy and accountability in all stages from conceptualization to deployment.\nREQUIREMENTS\nMinimum Qualifications:\nA minimum of 5+ years of experience/expertise in the following areas specified below:\nProven professional experience as a React Developer.\nStrong proficiency in React, TypeScript, JavaScript, CSS/SASS, and HTML.\nExperience with React libraries for state management (such as Redux or MobX) and routing.\nDemonstrated experience with Angular.\nIn-depth knowledge of frontend development, including state management, component lifecycle, and UI/UX principles.\nExperience in designing and consuming RESTful APIs.\nProficiency in the English language.\nExperience in Agile software development methodologies.\nExpertise in applying Object-Oriented Programming principles (abstraction, encapsulation).\nExperience in creating and implementing well-tested, scalable, and performant enterprise-level systems.\nAdditional Experience Desired\nGood understanding of SOLID principles.\nFamiliarity with OWASP.\nAbility to optimize frontend performance and troubleshoot complex issues.\nFamiliarity with modern frontend build tools and CI/CD pipelines.\nExcellent problem-solving skills and a proactive attitude towards challenges.\nStrong verbal and written communication skills.\nand\nObject-Relational Mappers (ORMs)\nArchitectural (Microservices, Serverless etc) and Design (Factory, Singleton, Observer etc) Patterns\nUnit Testing\nWorking in the Cloud (AWS)\nDesign proficiency following UML / C4 / ArchiMate.\nPractice and initiative mentoring other engineers and decision-makers throughout the organization.\nBENEFITS\nA competitive annual salary based on experience and market demands\nFlexi-timings\nWork From Anywhere\nMedical insurance with the option to purchase a premium plan or HSA option for your entire family\nRegular Health check-up camps arranged by the company\nRecreational activities (Pool, TT, Wii, PS2)\nBusiness casual atmosphere\n#LI-Remote\n#LI-PR\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to React, Design and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $140,000/year\nBenefits\n🚑 Medical insurance\nLocation\nIndia Remote",
        "url": "https://remoteok.com/remote-jobs/remote-software-engineer-react-3pillar-1093888"
    },
    {
        "title": "Developer Relations Engineer",
        "company": "Arbitrum Foundation",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "About Arbitrum Foundation\nThe Arbitrum Foundation is dedicated to scaling Ethereum through cutting-edge Layer 2 solutions. Our flagship product, Arbitrum One, an Optimistic Rollup, enables faster, more affordable transactions while maintaining Ethereum’s security and decentralization. We empower developers to build decentralized applications (dApps) that are both scalable and secure, using Arbitrum chains, which offer flexibility in performance and cost. Our mission is to enhance the Ethereum ecosystem and drive the adoption of Web3 technology by delivering high-performance, open-source blockchain solutions. Arbitrum is already the leading Ethereum scaling solution with hundreds of dApps on the platform and over $13bn TVL.\nAt the Arbitrum Foundation, we value decentralization, innovation, and community. We are committed to shaping the future of decentralized finance and blockchain technology, and we’re looking for passionate individuals to help us build the next generation of the Web.\nRole\nWe are looking for an enthusiastic and skilled Developer Relations Engineer to become a key member of our team. This is a LATAM-focused role, and fluency in Spanish is a hard requirement to effectively support our regional developer ecosystem.\nAs part of the Engineering team, you will be instrumental in driving the adoption of our Layer 2 solutions by contributing to the ecosystem with workshops, technical content and building meaningful relationships with developers. At the same time, you will be supporting the foundation departments when it comes down to their technical needs. If you stay up-to-date with the latest developments in blockchain technology, particularly in the Ethereum ecosystem, and you have a genuine passion for collaborating with developers, we would love to connect with you.\nYour Responsibilities\nDeveloper Engagement: Build and maintain strong relationships with developers, both within and outside the Arbitrum community. Act as a key point of contact for technical inquiries and support.\nAdvocacy and Community building: Serve as a passionate advocate for Arbitrum by developing and executing strategies to grow and nurture a vibrant developer community around Arbitrum. Organise meetups, webinars, workshops, and other events to facilitate knowledge sharing and collaboration.\nContributing: Create and maintain technical documentation, tutorials, and contribute to the open source ecosystem to help developers integrate with Arbitrum seamlessly. Deliver educational content through various channels.\nFeedback Loop: Gather feedback from developers and relay it to our product and engineering teams. Advocate for developers' needs and priorities within the organisation.\nCollaboration: Collaborate closely with the internal cross-functional teams, including marketing, product management, and engineering, to align developer outreach with our strategic goals.\nMetrics and Reporting: Track and analyse developer engagement metrics to measure the impact of developer relations efforts. Use data-driven insights to refine strategies.\nAssess leads (e.g. grant proposals, product requirement documents, etc) from a technical standpoint, focusing on the technical team capabilities, architecture and source code and the timeline credibility.\nContributing back to the ecosystem via open source contributions or the production of other educational materials\nWhat You'll Need\nYou are fluent in one or more general-purpose languages (e.g. Typescript, Python, Go, Rust, Java, etc)\nFundamentals of Solidity\nDeep understanding of blockchain technology and EVM solutions.\nStrong English communication and presentation skills, with the ability to convey complex technical concepts to diverse audiences.\nFluency in Spanish is a hard requirement.\nSelf-motivated, proactive, and able to work independently.\nExcellent problem-solving and troubleshooting skills.\nBachelor in computer science or equivalent work experience\nNice to have\nPrior experience in developer relations, developer advocacy, or a related role in the tech industry, within the blockchain or cryptocurrency space.\nDemonstrated experience in community building and engagement.\nPrior commercial experience with Solidity\nExposure to Rust\nOpen-source contributor in the EVM space\nYou speak another language (e.g. Hindi, Korean, Japanese)\nArbitrum Foundation Perks\nThe Arbitrum Foundation's benefits program is designed to prioritize the health and well-being of you and your family. Our comprehensive compensation package offers a range of benefits for all full-time employees:\nRemote first global workforce\nIndustry-leading healthcare insurance\nHome office set-up allowance\nWellbeing allowance\nGrowth / continuing education allowance\nFlexible time off\nCompany-issued laptop\nThe Arbitrum Foundation is committed to a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate based on race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. The Arbitrum Foundation is committed to treating all people in a way that allows them to maintain their dignity and independence. We believe in integration and equal opportunity. Accommodations are available throughout the recruitment process and applicants with a disability may request to be accommodated throughout the recruitment process. We will work with all applicants to accommodate their individual accessibility needs.\nIf you believe you're a strong candidate but don’t meet every requirement listed in the job description, we still encourage you to reach out. We’d love the opportunity to connect and explore how you could be a great fit for the role.\nLearn More about The Arbitrum Foundation\nWebsite|Twitter|Telegram|Discord|LinkedIn\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Finance and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $70,000 — $140,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-developer-relations-engineer-arbitrum-foundation-1093885"
    },
    {
        "title": "Senior Software Engineer PHP and Laravel",
        "company": "3Pillar",
        "location": "🇮🇳 India",
        "salary": null,
        "description": "Elevate your expertise to new heights at 3Pillar, the premier destination for trailblazing senior software engineers like yourself. Picture collaborating with industry leaders, spearheading transformative projects that redefine urban living, establishing new media channels for enterprise companies, or driving innovation in healthcare. Our mission is to revolutionize the tech landscape, and your skills are integral to achieving this ambitious goal.\nYour role extends beyond the realm of code composition; you will architect transformative solutions that reshape entire industries. Join us and spearhead the charge toward a tech future that transcends the ordinary.\nKey Responsibilities:\nFacilitate effective communication with client project stakeholders regarding project status and recommendations.\nCraft client code that is not just efficient but also performant, testable, scalable, secure, and of the highest quality.\nActively participate in accurate planning and estimation efforts, utilizing project methods and tools.\nProficiently gather requirements and organize/present developed features for clients.\nExecute complex activities within the current methodology and quality standards, showcasing success across diverse engagements.\nPromote client success across the team by collaborating with engineers, designers, and managers to understand user pain points, anticipate potential problems, and iterate on solutions that drive client success.\nEngage in agile software development, including daily stand-ups, sprint planning, team retrospectives, and other governance activities.\nIndependently drive project delivery within defined architecture, demonstrating autonomy and accountability in all stages from conceptualization to deployment.\nMandatory and Good to Have Skillsets :\nMandatory\nA minimum of 5+ years of experience in enterprise-level software development\nProficiency in the English language.\nStrong proficiency in PHP7/8 and Laravel.\nGood understanding of Laravel Architecture & Design Principles.\nGood understanding of MariaDB.\nGood understanding of Kubernetes/Docker.\nExpertise in implementing complex OOP Design Patterns.\nUnderstanding of DRY & KISS software design principles.\nUnderstanding of IaC.\nExperience in Agile software development methodologies.\nExperience in creating and implementing well-tested, scalable, and performant enterprise-level systems.\nFamiliarity with OWASP.\nGood to Have\nExperience with Terraform.\nExperience with Redis.\nExperience with Jenkins.\nExperience with RabbitMQ.\nExperience with DynamoDB.\nExperience with UML / C4 / ArchiMate/ ERD.\nGood understanding of SOLID principles.\nFamiliarity with OWASP.\nPractice and initiative mentoring other engineers and decision-makers throughout the organization.\nAt 3Pillar, we offer a world of opportunity:\nImagine a flexible work environment – whether it's the office, your home, or a blend of both. \nFrom interviews to onboarding, we embody a remote-first approach. \nYou will be part of a global team, learning from top talent around the world and across cultures, speaking English everyday. \nOur global workforce enables our team to leverage global resources to accomplish our work in efficient and effective teams. \nWe’re big on your well-being – as a company, we spend a whole trimester in our annual cycle focused on wellbeing. \nWhether it is taking advantage of fitness offerings, mental health plans (country-dependent), or simply leveraging generous time off, we want all of our team members operating at their best.\nOur professional services model enables us to accelerate career growth and development opportunities - across projects, offerings, and industries.\nWe are an equal opportunity employer. \nIt goes without saying that we live by values like Intrinsic Dignity and Open Collaboration to create cutting-edge technology AND reinforce our commitment to diversity - globally and locally. \nJoin us and be a part of a global tech community! \nCheck out our Linkedin site and Careers page to learn more about what it’s like to be part of our #oneteam!\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, PHP, Senior and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $145,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nIndia",
        "url": "https://remoteok.com/remote-jobs/remote-senior-software-engineer-php-and-laravel-3pillar-1093881"
    },
    {
        "title": "Manager Site Reliability & DevOps",
        "company": "Endpoint Clinical",
        "location": "🇮🇳 India",
        "salary": null,
        "description": "About Us:\nEndpoint is an interactive response technology (IRT®) systems and solutions provider that supports the life sciences industry. Since 2009, we have been working with a single vision in mind, to help sponsors and pharmaceutical companies achieve clinical trial success. Our solutions, realized through the proprietary PULSE® platform, have proven to maximize the supply chain, minimize operational costs, and ensure timely and accurate patient dosing. Endpoint is headquartered in Raleigh-Durham, North Carolina with offices across the United States, Europe, and Asia.\nPosition Overview:\n \nThe Sr. Manager, Site Reliability & DevOps leads, manages, and coaches endpoint’s Site Reliability, DBA, and Cloud Engineering teams to help build, operate, and ensure reliability of endpoint’s software systems. This individual will work across departments and disciplines such as product, engineering, operations, support services and IT to deliver cloud infrastructure, database code, and deployment pipelines facilitating quality, reliability, and availability of endpoint’s systems.\nResponsibilities:\nManages, coaches, and provides mentorship to      individuals to help guide and suggest approaches to complex situations\nWorks across organizations to quickly help      triage and resolve complex issues\nLeads delivery of Cloud Infrastructure,      Deployment Pipelines, and Database Code.\nFacilitates and help resolve tier 4 support      issues on core endpoint products and services\nIdentifies proactive measures to monitoring,      logging, and visibility into the health of endpoint’s environments\nDrives initiatives and efforts to produce      solutions to production incidents for products, integrations, and      escalated services.\nLeads, organizes, and supports 24x7 Follow      the Sun operations including engineering & operational coordination      between onshore & offshore teams.\nIn conjunction with other teams drives root      cause analysis and solution definition on issues\nHas awareness of all endpoint systems and      integrations and helps facilitates issues to resolution on such issues.\nParticipate in product and feature design      reviews to ensure scalable and reliable solutions are developed.\nHelps establish, build, and organize people      and systems to best drive the team forward.\n·        Coordinate with various departments to help facilitate knowledge transfer, technical solutions, and proactive measures are incorporated and considered with all endpoint product and services.\nEducation:\nBachelor's degree in Computer Science, Electrical Engineering, or equivalent\nExperience:\nMinimum 5 years’ experience as a Systems Engineer, DevOps Engineer or Systems Reliability Engineer role including mixed hardware/software systems.\nExperience in complex system analysis and simulations.\nExperience in design and build of high-accuracy and high-reliability systems.\nExperience building IaC and deployment pipelines, preferably in Azure.\nExperience in design, creation, and optimization of distributed applications\nMinimum Operating System Experience: Windows Server 2012. Linux experience is a plus.\nWorking knowledge of SQL server 2014, IIS.\nWorking knowledge of Networking and network protocols for hybrid and cloud solutions\nHands on experience in scripting languages (e.g. perl, Python, powershell, bash, etc) - structured languages experience (e.g. C#, Java) is a plus.\nIn depth knowledge and production experience with the VMware vSphere Enterprise, AWS, Azure.\nExperience leading 24x7 Engineering & Operations teams coordinating logistics between onshore & offshore teams delivering seamless execution with 99.95% availability.\nExperience in Design/Architecture of AWS, Microsoft Azure and hybrid cloud solutions, a plus\nSkills:\nStrong attention to detail\nExcellent organizational and time management skills\nExcellent communication skills\nMust have strong technical and interpersonal skills\nExcellent troubleshooting skills\n₹20,00,000 - ₹40,00,000 a year\nEndpoint Clinical does not accept unsolicited resumes from search firms or any other third parties. Any unsolicited resume sent to Endpoint Clinical will be considered Endpoint Clinical property, and Endpoint Clinical will not pay a fee should it hire the subject of any unsolicited resume.\nEndpoint Clinical is an equal opportunities employer AA/M/F/Veteran/Disability.    \n \nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment, qualified applicants with arrest and conviction records.\nLI-MT\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, DevOps, Engineer and Linux jobs that are similar:\n\n\n                                                                                                                                                             $70,000 — $145,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nRemote India",
        "url": "https://remoteok.com/remote-jobs/remote-manager-site-reliability-amp-devops-endpoint-clinical-1093880"
    },
    {
        "title": "Senior Staff DevOps Engineer",
        "company": "Manifest",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Your Impact at Manifest\nManifest is seeking to hire an experienced DevOps Engineer who will own the design, development, implementation, and ongoing operation of Manifest’s infrastructure and build/release pipelines. You will extend and improve our existing processes and systems, ensuring that our pipelines are fast, secure, performant, and scalable. By dogfooding Manifest’s core products, you will also be closely involved with Product and driving the direction of our product roadmaps and helping our users build and deliver software with less risk and greater security.\nAs a Senior/Staff Platform Engineer, you will:\nBe deeply experienced with developing and deploying IaC and automation (Terraform, Ansible, Helm, Python, etc.) on a routine basis to support platform and customer requirements with a focus towards automation as much as practicable.\nHave operated and sustained cloud-based CI/CD pipeline and components utilizing DevSecOps principles, a strong eye on shift left mindset, and best practices including reducing human involvement through automation and similar.\nAutomated application deployment leveraging container technology in a cloud-based environment through tools such as Kubernetes, Github, and other CI/CD tools and technologies\nBuilt tools and packaging to allow Manifest to be deployed in varied runtime environments - Cloud (AWS 1st, Azure/GCP secondary) on-prem, air gapped, FedRamp, etc.).\nDogfood our own software supply chain product\nIntegrate DevSecOps tools and services to enable an automated pipeline that supports customer applications throughout their SDLC.\nResearch and use the latest in open-source tools to help build and secure our development pipeline\nImplement and improve observability starting with data gathering for MELT (Metrics, Events, Logs, Traces) and implementing presentation and alerting within our applications and infrastructure.\nHave deep experience deploying and operating applications with Kubernetes in a Cloud environment.\nHave strong verbal and written communication skills including production of design and other technical documents.\nUnderstand how to expose public endpoints including UI and APIs using load balancers, CDNs, and other tools do deliver robust, secure, highly available services.\nBe strong at networking and runtime troubleshooting experience including the challenges in debugging lights out, dynamic, complex, remote environments including Kubernetes and airgapped.\nPrevious experience with commercial software products (SaaS and on-prem) that support 3rd party/external customers.\nBe well versed in Secure SDLC practices including external bug reports and SVM (software vulnerability management) lifecycle tools and processes.\nDesirable skills and experience to increase your impact:\nBe capable at assisting application and backend developers on delivering secure applications including appropriate resource polices (CORS headers, etc) and supporting API security engineering by contributing to design and review.\nExperience with Kubernetes in edge environments including bare VM and bare metal.\nPackaging software for on-prem and edge environments using form factors like virtual appliances and containers using tools like Helm charts, Packer, etc.\nSecuring clouds (AWS), containers, and Kubernetes\nSecuring SDLC pipelines (e.g. using SCA/SAST/DAST tools)\nExperience supporting infrastructure deployed in US Government networks (FedRAMP, CMMC, etc.)\nExperience with SBOM generation tools and formats including Syft, Trivy, CycloneDX, and related vulnerability scanners such as Grype and Trivy.\nExperience with other FOSS and Commercial SDLC security and DevSecOps tooling including SCA, DAST, SAST, etc.\nExperience deploying and supporting self hosted LLMs.\nUnderstand how to safely expose public endpoints including UI and APIs using load balancers, CDNs, and other tools do deliver robust, secure, highly available services.\nStrong networking and runtime troubleshooting experience including the challenges in debugging lights out, dynamic, complex, remote environments including Kubernetes and airgapped.\nBenefits of working @ Manifest\n🔍 Help organizations get new-found visibility into their software, and be more secure!\n🌎 Fully remote work (with potential for hybrid co-working)\n🌴 Unlimited PTO (which we take seriously)\n🏥 Medical/dental/vision insurance coverage for you and your dependents paid at 100%!\n💵 Competitive salary & meaningful stock options\n🏦 401(k) and retirement options\n⚒️ Help get in at the ground floor of a well-funded, early stage startup!\n🦄 Additional benefits to come (retirement, holiday gifts, etc.)\n$150,000 - $210,000 a year\nWe're a lean team, so your impact will be felt immediately and opportunities for growth are abundant at our scaling company. If this all sounds like a good fit for you, why not join us?\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, DevOps, API, Senior, Engineer and Backend jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $145,000/year\nBenefits\n💰 401(k)\n🤓 Vision insurance\nLocation\nRemote",
        "url": "https://remoteok.com/remote-jobs/remote-senior-staff-devops-engineer-manifest-1093878"
    },
    {
        "title": "Amazon Connect IVR QA R01553996",
        "company": "Brillio",
        "location": "🇺🇸 United States",
        "salary": null,
        "description": "About Brillio:\nBrillio is one of the fastest growing digital technology service providers and a partner of choice for many Fortune 1000 companies seeking to turn disruption into a competitive advantage through innovative digital adoption. Brillio, renowned for its world-class professionals, referred to as \"Brillians\", distinguishes itself through their capacity to seamlessly integrate cutting-edge digital and design thinking skills with an unwavering dedication to client satisfaction. \nBrillio takes pride in its status as an employer of choice, consistently attracting the most exceptional and talented individuals due to its unwavering emphasis on contemporary, groundbreaking technologies, and exclusive digital projects. Brillio's relentless commitment to providing an exceptional experience to its Brillians and nurturing their full potential consistently garners them the Great Place to Work® certification year after year.\nConsultant\nPrimary Skills\nAWS Elastic Beanstalk, AWS Lambda, Amazon CloudFront, Amazon API Gateway, AWS Step Function\nSpecialization\nAWS Development: Senior Lead Engineer\nJob requirementsJob Title: Automation Test Engineer – Amazon Connect, IVR, CyaraOverview:·       We are seeking a skilled Automation Test Engineer with deep expertise in Amazon Connect, IVR systems, and Cyara. The role involves designing, developing, and executing automated tests to ensure the reliability and performance of contact center solutions.Key Responsibilities:1. Test Automation & Execution·       Design and maintain automated test scripts for Amazon Connect call flows.·       Use Cyara to simulate real-world voice interactions and stress-test IVR components.·       Validate performance and functionality of contact center solutions.·       Integrate API-based tests (e.g., using Postman or custom scripts) for inbound/outbound call simulations.2. Test Management & Reporting·       Develop and manage test cases, plans, and suites using QTest.·       Track defects, analyze test results, and report quality metrics.·       Collaborate with QA and development teams to resolve issues and improve testing processes.3. Collaboration & Continuous Improvement·       Work with cross-functional teams (developers, product managers, operations) to integrate testing into the CI/CD pipeline.·       Participate in agile ceremonies and contribute to refining testing strategies.·       Stay updated on testing trends and best practices.4. Documentation & Compliance·       Ensure all test documentation is complete and adheres to industry standards.·       Contribute to technical documentation and internal training materials. Required Qualifications:·       5+ years of experience in software testing with a focus on automation.·       Hands-on experience with Amazon Connect and IVR testing.·       Proven expertise in Cyara for automated contact center testing.·       Experience with QTest for test case and defect management.·       Proficiency in scripting languages like Python, Java, or JavaScript.·       Familiarity with API testing and CI/CD integration.·       Strong analytical and communication skills.Preferred Qualifications:·       Experience with additional automation tools and frameworks.·       Knowledge of broader AWS services.·       Certifications in software testing or QA\n$70 - $75 an hourEqual Employment Opportunity DeclarationBrillio is an equal opportunity employer to all, regardless of age, ancestry, colour, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding, and related medical conditions), and sexual orientation.\nLI-PS1\nKnow more about Brillio : https://www.brillio.com/join-us/\nPPE: https://www.brillio.com/platform-and-product-engineering/\nKnow what it’s like to work and grow at Brillio: Click here\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Amazon, Design, API, Senior and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $140,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nSaint Louis, Missouri, United States",
        "url": "https://remoteok.com/remote-jobs/remote-amazon-connect-ivr-qa-r01553996-brillio-1093874"
    },
    {
        "title": "Smart Contract Engineer",
        "company": "Aragon",
        "location": "💰 Upgrade to Premium to see salary",
        "salary": null,
        "description": "Aragon is a team of 24 people that spans a broad range of backgrounds, interests, and geographies. We're entrepreneurs, technologists and skeptics, troublemakers and problem solvers, who are building unstoppable tooling for the creation and management of Onchain Organizations. Our mission is to enable any organization to experiment with governance at the speed of software and we envision a world where humans can coordinate by the rule of code, reducing the need for enforcement by trusted systems, often through the use of violence.\nAragon launched the first DAO framework in 2017, securing over $40 billion in assets for the likes of Lido and Curve. We are currently building Aragon OSx & App, a new and improved tech-stack supporting projects such as Polygon and Taiko.\nAs a Smart Contract Developer at Aragon, you will be joining the solutions team, where you'll be directly involved in designing and building custom integrations for clients on top of the Aragon OSx protocol.\n💪 What do we expect from the  Smart Contract Developer?\nTransform client needs into technical designs and production-ready code, always considering the user.\nLead projects from inception to live maintenance, emphasizing secure and high-quality delivery at every phase.\nExhibit deep expertise in Solidity, having not just deployed smart contracts but designed intricate contract architectures addressing real-world business challenges.\nHave an understanding of Decentralized Finance (DeFi) and the workings of major DeFi protocols.  Foster enthusiastic collaboration with other product and engineering squads, further deepening everyone’s knowledge of the ever-expanding technologies of web3.\nEngage in daily stand-ups, knowing when your expertise is critical, and step up to proactively solve your teammate’s challenges.\nBuild solutions with a strong grasp of software architecture best practices and common standards across the Ethereum ecosystem and in the Decentralized Finance space.\n⚠️ Minimum requisites\n3+ years delivering software to real users, ideally in a fast-paced startup environment\nExpert-level Solidity experience, including the design and optimization of advanced smart contract systems\nStrong foundation in smart contract security, with a history of successful audits and knowledge of common vulnerabilities\nStrong working proficiency in foundry and hardhat\nFamiliarity with or contributions to Ethereum EIPs\nSignificant technical contributions to DeFi protocols with at least 8 figures in TVL\nFluency in typescript, and popular libraries such as Ethers (v5, v6) and viem.\nExperience working across multiple EVM networks - sidechains, OP rollups and Zk rollups\nProven contributions to open-source projects within blockchain, cryptography, decentralized systems, or the broader web3 ecosystem\nUnderstanding of how to work in an agile environment, using git, and tools like Linear and Github\nPassionate about the possibilities of decentralized autonomous organizations and the impacts they may have on how humans work together to solve problems\nExcellent English and technical communication - both written and oral\nYou are able to attend quarterly offsites - usually located in or around Europe - to work in person with your team\n💡 Bonus skills\nExperience or certification in formal verification of smart contracts\nKnowledge or hands on experience working with other parts of our stack, like NextJS, Turborepo, Envio, IPFS\nInterest in the use of LLMs to enhance developer productivity\nWorking knowledge of advanced security tools such as HEVM, Slither, Echidna, foundry Invariant tests.\nDemonstrated experience using Vyper, Go or Rust\nProven mentoring skills, fostering a culture of growth and learning within teams\nPower user of DeFi and/or Web3 applications\nWe value freedom and responsibility among our contributors. In practice, this means that we're a remotely distributed organization that's flexible but pragmatic. The team gets together for quarterly in-person offsites where we strengthen our alignment, drive projects forward, and have fun in different locations across Europe. We will trust you to accommodate and support your team, and communicate if you ever feel stretched thin. You will get all of the resources needed to be effective, whether it’s for setting up your remote work environment or a personal development budget. You will be a part-owner of Aragon X and you are expected to work with this mentality.\nThis role reports to Aragon X, a Swiss AG dedicated to advancing the Aragon Project. We are an Equal Opportunity Employer supporting a community of DAO creators, developers, and users experimenting with new forms of social coordination and governance.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Web3, Solidity, Finance and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $60,000 — $150,000/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nRemote - Europe",
        "url": "https://remoteok.com/remote-jobs/remote-smart-contract-engineer-aragon-1093858"
    },
    {
        "title": "Job 23962 Mid Senior Observability Engineer Colombia",
        "company": "CI&T",
        "location": "🇨🇴 Colombia",
        "salary": null,
        "description": "We are tech transformation specialists, uniting human expertise with AI to create scalable tech solutions.\nWith over 7,400 CI&Ters around the world, we’ve built partnerships with more than 1,000 clients during our 30 years of history. Artificial Intelligence is our reality.\nWe are looking for an Observability Engineer to join our team and work for a large multinational company in the food and beverage sector. This is an opportunity to handle monitoring and system reliability in a high-scale, complex environment. If you have experience in SRE and are seeking challenges in large-scale operations, this is the role for you!\nPosition also available for Mid-Level Developers interested in transitioning to the SRE role.\nIf you're a developer who's already used to working on international projects, using English evryday, and wants to migrate to observability, this is the ideal place for you!\nResponsibilities:\nPerformance Monitoring and Analysis: Monitor and analyze the performance of production systems, creating high-quality alerts to improve incident detection and prevention.\nPreferred tools: AppDynamics (advantageous), New Relic, DataDog, Dynatrace, or similar.\nSoftware Architecture Support: With prior experience in software development, understand the solution’s architecture and identify opportunities to enable monitoring and custom alerts.\nPreferred languages: Java and/or Golang (not mandatory).\nTroubleshooting: Investigate real-world production issues using reported metrics to identify root causes, collaborating with the application team.\nCollaboration: Work closely with development teams to improve the reliability and performance of services.\nRequirements for this challenge:\nPractical experience with performance monitoring tools (AppDynamics is a plus, but New Relic, DataDog, or Dynatrace are also acceptable).\nBackground in software development, with a solid understanding of architecture and system integration.\nKnowledge of programming languages such as Java and/or Golang (preferred, not mandatory).\nExperience with SRE practices and DevOps culture.\nExperience in troubleshooting and solving production issues.\nAdvanced oral and written communication skills in English.\nNice to have:\nFamiliarity with Kubernetes, Docker, or other containerization technologies.\nKnowledge of process automation and infrastructure as code (Terraform, Ansible, etc.).\nIf you like it, just apply and good luck!\nLI-JM2\nOur benefits include:\nPremium Healthcare\nMeal voucher\nMaternity and Parental leaves\nMobile services subsidy\nSick pay-Life insurance\nCI&T University\nColombian Holidays\nPaid Vacations\nAnd many others.\nCollaboration is our superpower, diversity unites us, and excellence is our standard. \nWe value diverse identities and life experiences, fostering a diverse, inclusive, and safe work environment. We encourage applications from diverse and underrepresented groups to our job positions.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to DevOps, Java, Mobile, Senior, Golang and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $65,000 — $122,500/year\nBenefits\n💰 401(k)\n🌎 Distributed team\n⏰ Async\n🤓 Vision insurance\n🦷 Dental insurance\n🚑 Medical insurance\n🏖 Unlimited vacation\n🏖 Paid time off\n📆 4 day workweek\n💰 401k matching\n🏔 Company retreats\n🏬 Coworking budget\n📚 Learning budget\n💪 Free gym membership\n🧘 Mental wellness budget\n🖥 Home office budget\n🥧 Pay in crypto\n🥸 Pseudonymous\n💰 Profit sharing\n💰 Equity compensation\n⬜️ No whiteboard interview\n👀 No monitoring system\n🚫 No politics at work\n🎅 We hire old (and young)\nLocation\nColombia",
        "url": "https://remoteok.com/remote-jobs/remote-job-23962-mid-senior-observability-engineer-colombia-ciampt-1093853"
    },
    {
        "title": "Job 23962 Mid Senior Observability Engineer Brazil",
        "company": "CI&T",
        "location": "🇧🇷 Brazil",
        "salary": null,
        "description": "We are tech transformation specialists, uniting human expertise with AI to create scalable tech solutions.\nWith over 7.400 CI&Ters around the world, we’ve built partnerships with more than 1,000 clients during our 30 years of history. Artificial Intelligence is our reality.\nWe are looking for an Observability Engineer to join our team and work for a large multinational company in the food and beverage sector. This is an opportunity to handle monitoring and system reliability in a high-scale, complex environment. If you have experience in SRE and are seeking challenges in large-scale operations, this is the role for you!\nPosition also available for Mid-Level Developers interested in transitioning to the SRE role.\nIf you're a developer who's already used to working on international projects, using English evryday, and wants to migrate to observability, this is the ideal place for you!\nResponsibilities:\nPerformance Monitoring and Analysis: Monitor and analyze the performance of production systems, creating high-quality alerts to improve incident detection and prevention.\nPreferred tools: AppDynamics (advantageous), New Relic, DataDog, Dynatrace, or similar.\nSoftware Architecture Support: With prior experience in software development, understand the solution’s architecture and identify opportunities to enable monitoring and custom alerts.\nPreferred languages: Java and/or Golang (not mandatory).\nTroubleshooting: Investigate real-world production issues using reported metrics to identify root causes, collaborating with the application team.\nCollaboration: Work closely with development teams to improve the reliability and performance of services.\nRequirements for this challenge:\nPractical experience with performance monitoring tools (AppDynamics is a plus, but New Relic, DataDog, or Dynatrace are also acceptable).\nBackground in software development, with a solid understanding of architecture and system integration.\nKnowledge of programming languages such as Java and/or Golang (preferred, not mandatory).\nExperience with SRE practices and DevOps culture.\nExperience in troubleshooting and solving production issues.\nAdvanced oral and written communication skills in English.\nNice to have:\nFamiliarity with Kubernetes, Docker, or other containerization technologies.\nKnowledge of process automation and infrastructure as code (Terraform, Ansible, etc.).\nIf you like it, just apply and good luck!\nLI-JM2\nOur benefits:\n-Health and dental insurance\n-Meal and food allowance\n-Childcare assistance\n-Extended paternity leave\n-Partnership with gyms and health and wellness professionals via Wellhub (Gympass) TotalPass;\n-Profit Sharing and Results Participation (PLR);\n-Life insurance\n-Continuous learning platform (CI&T University);\n-Discount club\n-Free online platform dedicated to physical, mental, and overall well-being\n-Pregnancy and responsible parenting course\n-Partnerships with online learning platforms\n-Language learning platform\nAnd many more!\nMore details about our benefits here: https://ciandt.com/br/pt-br/carreiras\nAt CI&T, inclusion starts at the first contact. If you are a person with a disability, it is important to present your assessment during the selection process. This way, we can ensure the support and accommodations that you deserve. If you do not yet have the assessment, don't worry: we can support you in obtaining it.\nWe have a dedicated Health and Well-being team, inclusion specialists, and affinity groups who will be with you at every stage. Count on us to make this journey side by side.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to DevOps, Java, Senior, Golang and Engineer jobs that are similar:\n\n\n                                                                                                                                                             $70,000 — $145,000/year\nBenefits\n🦷 Dental insurance\n💰 Profit sharing\nLocation\nBrazil",
        "url": "https://remoteok.com/remote-jobs/remote-job-23962-mid-senior-observability-engineer-brazil-ciampt-1093852"
    }
]